MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1618/mcu.h
// Register: PID1ACCLL
#define PID1ACCLL PID1ACCLL
extern volatile unsigned char           PID1ACCLL           __at(0x60F);
#ifndef _LIB_BUILD
asm("PID1ACCLL equ 060Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1ACC0               :1;
        unsigned PID1ACC1               :1;
        unsigned PID1ACC2               :1;
        unsigned PID1ACC3               :1;
        unsigned PID1ACC4               :1;
        unsigned PID1ACC5               :1;
        unsigned PID1ACC6               :1;
        unsigned PID1ACC7               :1;
    };
    struct {
        unsigned ACC0                   :1;
        unsigned ACC1                   :1;
        unsigned ACC2                   :1;
        unsigned ACC3                   :1;
        unsigned ACC4                   :1;
        unsigned ACC5                   :1;
        unsigned ACC6                   :1;
        unsigned ACC7                   :1;
    };
} PID1ACCLLbits_t;
extern volatile PID1ACCLLbits_t PID1ACCLLbits __at(0x60F);
// bitfield macros
#define _PID1ACCLL_PID1ACC0_POSN                            0x0
#define _PID1ACCLL_PID1ACC0_POSITION                        0x0
#define _PID1ACCLL_PID1ACC0_SIZE                            0x1
#define _PID1ACCLL_PID1ACC0_LENGTH                          0x1
#define _PID1ACCLL_PID1ACC0_MASK                            0x1
#define _PID1ACCLL_PID1ACC1_POSN                            0x1
#define _PID1ACCLL_PID1ACC1_POSITION                        0x1
#define _PID1ACCLL_PID1ACC1_SIZE                            0x1
#define _PID1ACCLL_PID1ACC1_LENGTH                          0x1
#define _PID1ACCLL_PID1ACC1_MASK                            0x2
#define _PID1ACCLL_PID1ACC2_POSN                            0x2
#define _PID1ACCLL_PID1ACC2_POSITION                        0x2
#define _PID1ACCLL_PID1ACC2_SIZE                            0x1
#define _PID1ACCLL_PID1ACC2_LENGTH                          0x1
#define _PID1ACCLL_PID1ACC2_MASK                            0x4
#define _PID1ACCLL_PID1ACC3_POSN                            0x3
#define _PID1ACCLL_PID1ACC3_POSITION                        0x3
#define _PID1ACCLL_PID1ACC3_SIZE                            0x1
#define _PID1ACCLL_PID1ACC3_LENGTH                          0x1
#define _PID1ACCLL_PID1ACC3_MASK                            0x8
#define _PID1ACCLL_PID1ACC4_POSN                            0x4
#define _PID1ACCLL_PID1ACC4_POSITION                        0x4
#define _PID1ACCLL_PID1ACC4_SIZE                            0x1
#define _PID1ACCLL_PID1ACC4_LENGTH                          0x1
#define _PID1ACCLL_PID1ACC4_MASK                            0x10
#define _PID1ACCLL_PID1ACC5_POSN                            0x5
#define _PID1ACCLL_PID1ACC5_POSITION                        0x5
#define _PID1ACCLL_PID1ACC5_SIZE                            0x1
#define _PID1ACCLL_PID1ACC5_LENGTH                          0x1
#define _PID1ACCLL_PID1ACC5_MASK                            0x20
#define _PID1ACCLL_PID1ACC6_POSN                            0x6
#define _PID1ACCLL_PID1ACC6_POSITION                        0x6
#define _PID1ACCLL_PID1ACC6_SIZE                            0x1
#define _PID1ACCLL_PID1ACC6_LENGTH                          0x1
#define _PID1ACCLL_PID1ACC6_MASK                            0x40
#define _PID1ACCLL_PID1ACC7_POSN                            0x7
#define _PID1ACCLL_PID1ACC7_POSITION                        0x7
#define _PID1ACCLL_PID1ACC7_SIZE                            0x1
#define _PID1ACCLL_PID1ACC7_LENGTH                          0x1
#define _PID1ACCLL_PID1ACC7_MASK                            0x80
#define _PID1ACCLL_ACC0_POSN                                0x0
#define _PID1ACCLL_ACC0_POSITION                            0x0
#define _PID1ACCLL_ACC0_SIZE                                0x1
#define _PID1ACCLL_ACC0_LENGTH                              0x1
#define _PID1ACCLL_ACC0_MASK                                0x1
#define _PID1ACCLL_ACC1_POSN                                0x1
#define _PID1ACCLL_ACC1_POSITION                            0x1
#define _PID1ACCLL_ACC1_SIZE                                0x1
#define _PID1ACCLL_ACC1_LENGTH                              0x1
#define _PID1ACCLL_ACC1_MASK                                0x2
#define _PID1ACCLL_ACC2_POSN                                0x2
#define _PID1ACCLL_ACC2_POSITION                            0x2
#define _PID1ACCLL_ACC2_SIZE                                0x1
#define _PID1ACCLL_ACC2_LENGTH                              0x1
#define _PID1ACCLL_ACC2_MASK                                0x4
#define _PID1ACCLL_ACC3_POSN                                0x3
#define _PID1ACCLL_ACC3_POSITION                            0x3
#define _PID1ACCLL_ACC3_SIZE                                0x1
#define _PID1ACCLL_ACC3_LENGTH                              0x1
#define _PID1ACCLL_ACC3_MASK                                0x8
#define _PID1ACCLL_ACC4_POSN                                0x4
#define _PID1ACCLL_ACC4_POSITION                            0x4
#define _PID1ACCLL_ACC4_SIZE                                0x1
#define _PID1ACCLL_ACC4_LENGTH                              0x1
#define _PID1ACCLL_ACC4_MASK                                0x10
#define _PID1ACCLL_ACC5_POSN                                0x5
#define _PID1ACCLL_ACC5_POSITION                            0x5
#define _PID1ACCLL_ACC5_SIZE                                0x1
#define _PID1ACCLL_ACC5_LENGTH                              0x1
#define _PID1ACCLL_ACC5_MASK                                0x20
#define _PID1ACCLL_ACC6_POSN                                0x6
#define _PID1ACCLL_ACC6_POSITION                            0x6
#define _PID1ACCLL_ACC6_SIZE                                0x1
#define _PID1ACCLL_ACC6_LENGTH                              0x1
#define _PID1ACCLL_ACC6_MASK                                0x40
#define _PID1ACCLL_ACC7_POSN                                0x7
#define _PID1ACCLL_ACC7_POSITION                            0x7
#define _PID1ACCLL_ACC7_SIZE                                0x1
#define _PID1ACCLL_ACC7_LENGTH                              0x1
#define _PID1ACCLL_ACC7_MASK                                0x80

// Register: PID1ACCLH
#define PID1ACCLH PID1ACCLH
extern volatile unsigned char           PID1ACCLH           __at(0x610);
#ifndef _LIB_BUILD
asm("PID1ACCLH equ 0610h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1ACC8               :1;
        unsigned PID1ACC9               :1;
        unsigned PID1ACC10              :1;
        unsigned PID1ACC11              :1;
        unsigned PID1ACC12              :1;
        unsigned PID1ACC13              :1;
        unsigned PID1ACC14              :1;
        unsigned PID1ACC15              :1;
    };
    struct {
        unsigned ACC8                   :1;
        unsigned ACC9                   :1;
        unsigned ACC10                  :1;
        unsigned ACC11                  :1;
        unsigned ACC12                  :1;
        unsigned ACC13                  :1;
        unsigned ACC14                  :1;
        unsigned ACC15                  :1;
    };
} PID1ACCLHbits_t;
