MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1618/mcu.h
// Register: CRCCON1
#define CRCCON1 CRCCON1
extern volatile unsigned char           CRCCON1             __at(0x79A);
#ifndef _LIB_BUILD
asm("CRCCON1 equ 079Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PLEN                   :4;
        unsigned DLEN                   :4;
    };
    struct {
        unsigned PLEN0                  :1;
        unsigned PLEN1                  :1;
        unsigned PLEN2                  :1;
        unsigned PLEN3                  :1;
        unsigned DLEN0                  :1;
        unsigned DLEN1                  :1;
        unsigned DLEN2                  :1;
        unsigned DLEN3                  :1;
    };
    struct {
        unsigned CRCPLEN                :4;
        unsigned CRCDLEN                :4;
    };
    struct {
        unsigned CRCPLEN0               :1;
        unsigned CRCPLEN1               :1;
        unsigned CRCPLEN2               :1;
        unsigned CRCPLEN3               :1;
        unsigned CRCDLEN0               :1;
        unsigned CRCDLEN1               :1;
        unsigned CRCDLEN2               :1;
        unsigned CRCDLEN3               :1;
    };
} CRCCON1bits_t;
extern volatile CRCCON1bits_t CRCCON1bits __at(0x79A);
// bitfield macros
#define _CRCCON1_PLEN_POSN                                  0x0
#define _CRCCON1_PLEN_POSITION                              0x0
#define _CRCCON1_PLEN_SIZE                                  0x4
#define _CRCCON1_PLEN_LENGTH                                0x4
#define _CRCCON1_PLEN_MASK                                  0xF
#define _CRCCON1_DLEN_POSN                                  0x4
#define _CRCCON1_DLEN_POSITION                              0x4
#define _CRCCON1_DLEN_SIZE                                  0x4
#define _CRCCON1_DLEN_LENGTH                                0x4
#define _CRCCON1_DLEN_MASK                                  0xF0
#define _CRCCON1_PLEN0_POSN                                 0x0
#define _CRCCON1_PLEN0_POSITION                             0x0
#define _CRCCON1_PLEN0_SIZE                                 0x1
#define _CRCCON1_PLEN0_LENGTH                               0x1
#define _CRCCON1_PLEN0_MASK                                 0x1
#define _CRCCON1_PLEN1_POSN                                 0x1
#define _CRCCON1_PLEN1_POSITION                             0x1
#define _CRCCON1_PLEN1_SIZE                                 0x1
#define _CRCCON1_PLEN1_LENGTH                               0x1
#define _CRCCON1_PLEN1_MASK                                 0x2
#define _CRCCON1_PLEN2_POSN                                 0x2
#define _CRCCON1_PLEN2_POSITION                             0x2
#define _CRCCON1_PLEN2_SIZE                                 0x1
#define _CRCCON1_PLEN2_LENGTH                               0x1
#define _CRCCON1_PLEN2_MASK                                 0x4
#define _CRCCON1_PLEN3_POSN                                 0x3
#define _CRCCON1_PLEN3_POSITION                             0x3
#define _CRCCON1_PLEN3_SIZE                                 0x1
#define _CRCCON1_PLEN3_LENGTH                               0x1
#define _CRCCON1_PLEN3_MASK                                 0x8
#define _CRCCON1_DLEN0_POSN                                 0x4
#define _CRCCON1_DLEN0_POSITION                             0x4
#define _CRCCON1_DLEN0_SIZE                                 0x1
#define _CRCCON1_DLEN0_LENGTH                               0x1
#define _CRCCON1_DLEN0_MASK                                 0x10
#define _CRCCON1_DLEN1_POSN                                 0x5
#define _CRCCON1_DLEN1_POSITION                             0x5
#define _CRCCON1_DLEN1_SIZE                                 0x1
#define _CRCCON1_DLEN1_LENGTH                               0x1
#define _CRCCON1_DLEN1_MASK                                 0x20
#define _CRCCON1_DLEN2_POSN                                 0x6
#define _CRCCON1_DLEN2_POSITION                             0x6
#define _CRCCON1_DLEN2_SIZE                                 0x1
#define _CRCCON1_DLEN2_LENGTH                               0x1
#define _CRCCON1_DLEN2_MASK                                 0x40
#define _CRCCON1_DLEN3_POSN                                 0x7
#define _CRCCON1_DLEN3_POSITION                             0x7
#define _CRCCON1_DLEN3_SIZE                                 0x1
#define _CRCCON1_DLEN3_LENGTH                               0x1
#define _CRCCON1_DLEN3_MASK                                 0x80
#define _CRCCON1_CRCPLEN_POSN                               0x0
#define _CRCCON1_CRCPLEN_POSITION                           0x0
#define _CRCCON1_CRCPLEN_SIZE                               0x4
#define _CRCCON1_CRCPLEN_LENGTH                             0x4
#define _CRCCON1_CRCPLEN_MASK                               0xF
#define _CRCCON1_CRCDLEN_POSN                               0x4
#define _CRCCON1_CRCDLEN_POSITION                           0x4
#define _CRCCON1_CRCDLEN_SIZE                               0x4
#define _CRCCON1_CRCDLEN_LENGTH                             0x4
#define _CRCCON1_CRCDLEN_MASK                               0xF0
#define _CRCCON1_CRCPLEN0_POSN                              0x0
#define _CRCCON1_CRCPLEN0_POSITION                          0x0
#define _CRCCON1_CRCPLEN0_SIZE                              0x1
#define _CRCCON1_CRCPLEN0_LENGTH                            0x1
#define _CRCCON1_CRCPLEN0_MASK                              0x1
#define _CRCCON1_CRCPLEN1_POSN                              0x1
#define _CRCCON1_CRCPLEN1_POSITION                          0x1
#define _CRCCON1_CRCPLEN1_SIZE                              0x1
#define _CRCCON1_CRCPLEN1_LENGTH                            0x1
#define _CRCCON1_CRCPLEN1_MASK                              0x2
#define _CRCCON1_CRCPLEN2_POSN                              0x2
#define _CRCCON1_CRCPLEN2_POSITION                          0x2
#define _CRCCON1_CRCPLEN2_SIZE                              0x1
#define _CRCCON1_CRCPLEN2_LENGTH                            0x1
#define _CRCCON1_CRCPLEN2_MASK                              0x4
#define _CRCCON1_CRCPLEN3_POSN                              0x3
#define _CRCCON1_CRCPLEN3_POSITION                          0x3
#define _CRCCON1_CRCPLEN3_SIZE                              0x1
#define _CRCCON1_CRCPLEN3_LENGTH                            0x1
#define _CRCCON1_CRCPLEN3_MASK                              0x8
#define _CRCCON1_CRCDLEN0_POSN                              0x4
#define _CRCCON1_CRCDLEN0_POSITION                          0x4
#define _CRCCON1_CRCDLEN0_SIZE                              0x1
#define _CRCCON1_CRCDLEN0_LENGTH                            0x1
#define _CRCCON1_CRCDLEN0_MASK                              0x10
#define _CRCCON1_CRCDLEN1_POSN                              0x5
#define _CRCCON1_CRCDLEN1_POSITION                          0x5
#define _CRCCON1_CRCDLEN1_SIZE                              0x1
#define _CRCCON1_CRCDLEN1_LENGTH                            0x1
#define _CRCCON1_CRCDLEN1_MASK                              0x20
#define _CRCCON1_CRCDLEN2_POSN                              0x6
#define _CRCCON1_CRCDLEN2_POSITION                          0x6
#define _CRCCON1_CRCDLEN2_SIZE                              0x1
#define _CRCCON1_CRCDLEN2_LENGTH                            0x1
#define _CRCCON1_CRCDLEN2_MASK                              0x40
#define _CRCCON1_CRCDLEN3_POSN                              0x7
#define _CRCCON1_CRCDLEN3_POSITION                          0x7
#define _CRCCON1_CRCDLEN3_SIZE                              0x1
#define _CRCCON1_CRCDLEN3_LENGTH                            0x1
#define _CRCCON1_CRCDLEN3_MASK                              0x80

// Register: AT1RES
#define AT1RES AT1RES
extern volatile unsigned short          AT1RES              __at(0x80C);
#ifndef _LIB_BUILD
asm("AT1RES equ 080Ch");
#endif

// Register: AT1RESL
#define AT1RESL AT1RESL
extern volatile unsigned char           AT1RESL             __at(0x80C);
#ifndef _LIB_BUILD
asm("AT1RESL equ 080Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1RES0                :1;
        unsigned AT1RES1                :1;
        unsigned AT1RES2                :1;
        unsigned AT1RES3                :1;
        unsigned AT1RES4                :1;
        unsigned AT1RES5                :1;
        unsigned AT1RES6                :1;
        unsigned AT1RES7                :1;
    };
    struct {
        unsigned RES0                   :1;
        unsigned RES1                   :1;
        unsigned RES2                   :1;
        unsigned RES3                   :1;
        unsigned RES4                   :1;
        unsigned RES5                   :1;
        unsigned RES6                   :1;
        unsigned RES7                   :1;
    };
} AT1RESLbits_t;
extern volatile AT1RESLbits_t AT1RESLbits __at(0x80C);
// bitfield macros
#define _AT1RESL_AT1RES0_POSN                               0x0
#define _AT1RESL_AT1RES0_POSITION                           0x0
#define _AT1RESL_AT1RES0_SIZE                               0x1
#define _AT1RESL_AT1RES0_LENGTH                             0x1
#define _AT1RESL_AT1RES0_MASK                               0x1
#define _AT1RESL_AT1RES1_POSN                               0x1
#define _AT1RESL_AT1RES1_POSITION                           0x1
#define _AT1RESL_AT1RES1_SIZE                               0x1
#define _AT1RESL_AT1RES1_LENGTH                             0x1
#define _AT1RESL_AT1RES1_MASK                               0x2
#define _AT1RESL_AT1RES2_POSN                               0x2
#define _AT1RESL_AT1RES2_POSITION                           0x2
#define _AT1RESL_AT1RES2_SIZE                               0x1
#define _AT1RESL_AT1RES2_LENGTH                             0x1
#define _AT1RESL_AT1RES2_MASK                               0x4
#define _AT1RESL_AT1RES3_POSN                               0x3
#define _AT1RESL_AT1RES3_POSITION                           0x3
#define _AT1RESL_AT1RES3_SIZE                               0x1
#define _AT1RESL_AT1RES3_LENGTH                             0x1
#define _AT1RESL_AT1RES3_MASK                               0x8
#define _AT1RESL_AT1RES4_POSN                               0x4
#define _AT1RESL_AT1RES4_POSITION                           0x4
#define _AT1RESL_AT1RES4_SIZE                               0x1
#define _AT1RESL_AT1RES4_LENGTH                             0x1
#define _AT1RESL_AT1RES4_MASK                               0x10
#define _AT1RESL_AT1RES5_POSN                               0x5
#define _AT1RESL_AT1RES5_POSITION                           0x5
#define _AT1RESL_AT1RES5_SIZE                               0x1
#define _AT1RESL_AT1RES5_LENGTH                             0x1
#define _AT1RESL_AT1RES5_MASK                               0x20
#define _AT1RESL_AT1RES6_POSN                               0x6
#define _AT1RESL_AT1RES6_POSITION                           0x6
#define _AT1RESL_AT1RES6_SIZE                               0x1
#define _AT1RESL_AT1RES6_LENGTH                             0x1
#define _AT1RESL_AT1RES6_MASK                               0x40
#define _AT1RESL_AT1RES7_POSN                               0x7
#define _AT1RESL_AT1RES7_POSITION                           0x7
#define _AT1RESL_AT1RES7_SIZE                               0x1
#define _AT1RESL_AT1RES7_LENGTH                             0x1
#define _AT1RESL_AT1RES7_MASK                               0x80
#define _AT1RESL_RES0_POSN                                  0x0
#define _AT1RESL_RES0_POSITION                              0x0
#define _AT1RESL_RES0_SIZE                                  0x1
#define _AT1RESL_RES0_LENGTH                                0x1
#define _AT1RESL_RES0_MASK                                  0x1
#define _AT1RESL_RES1_POSN                                  0x1
#define _AT1RESL_RES1_POSITION                              0x1
#define _AT1RESL_RES1_SIZE                                  0x1
#define _AT1RESL_RES1_LENGTH                                0x1
#define _AT1RESL_RES1_MASK                                  0x2
#define _AT1RESL_RES2_POSN                                  0x2
#define _AT1RESL_RES2_POSITION                              0x2
#define _AT1RESL_RES2_SIZE                                  0x1
#define _AT1RESL_RES2_LENGTH                                0x1
#define _AT1RESL_RES2_MASK                                  0x4
#define _AT1RESL_RES3_POSN                                  0x3
#define _AT1RESL_RES3_POSITION                              0x3
#define _AT1RESL_RES3_SIZE                                  0x1
#define _AT1RESL_RES3_LENGTH                                0x1
#define _AT1RESL_RES3_MASK                                  0x8
#define _AT1RESL_RES4_POSN                                  0x4
#define _AT1RESL_RES4_POSITION                              0x4
#define _AT1RESL_RES4_SIZE                                  0x1
#define _AT1RESL_RES4_LENGTH                                0x1
#define _AT1RESL_RES4_MASK                                  0x10
#define _AT1RESL_RES5_POSN                                  0x5
#define _AT1RESL_RES5_POSITION                              0x5
#define _AT1RESL_RES5_SIZE                                  0x1
#define _AT1RESL_RES5_LENGTH                                0x1
#define _AT1RESL_RES5_MASK                                  0x20
#define _AT1RESL_RES6_POSN                                  0x6
#define _AT1RESL_RES6_POSITION                              0x6
#define _AT1RESL_RES6_SIZE                                  0x1
#define _AT1RESL_RES6_LENGTH                                0x1
#define _AT1RESL_RES6_MASK                                  0x40
#define _AT1RESL_RES7_POSN                                  0x7
#define _AT1RESL_RES7_POSITION                              0x7
#define _AT1RESL_RES7_SIZE                                  0x1
#define _AT1RESL_RES7_LENGTH                                0x1
#define _AT1RESL_RES7_MASK                                  0x80

// Register: AT1RESH
#define AT1RESH AT1RESH
extern volatile unsigned char           AT1RESH             __at(0x80D);
#ifndef _LIB_BUILD
asm("AT1RESH equ 080Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1RES8                :1;
        unsigned AT1RES9                :1;
    };
    struct {
        unsigned RES8                   :1;
        unsigned RES9                   :1;
    };
} AT1RESHbits_t;
extern volatile AT1RESHbits_t AT1RESHbits __at(0x80D);
// bitfield macros
#define _AT1RESH_AT1RES8_POSN                               0x0
#define _AT1RESH_AT1RES8_POSITION                           0x0
#define _AT1RESH_AT1RES8_SIZE                               0x1
#define _AT1RESH_AT1RES8_LENGTH                             0x1
#define _AT1RESH_AT1RES8_MASK                               0x1
#define _AT1RESH_AT1RES9_POSN                               0x1
#define _AT1RESH_AT1RES9_POSITION                           0x1
#define _AT1RESH_AT1RES9_SIZE                               0x1
#define _AT1RESH_AT1RES9_LENGTH                             0x1
#define _AT1RESH_AT1RES9_MASK                               0x2
#define _AT1RESH_RES8_POSN                                  0x0
#define _AT1RESH_RES8_POSITION                              0x0
#define _AT1RESH_RES8_SIZE                                  0x1
#define _AT1RESH_RES8_LENGTH                                0x1
#define _AT1RESH_RES8_MASK                                  0x1
#define _AT1RESH_RES9_POSN                                  0x1
#define _AT1RESH_RES9_POSITION                              0x1
#define _AT1RESH_RES9_SIZE                                  0x1
#define _AT1RESH_RES9_LENGTH                                0x1
#define _AT1RESH_RES9_MASK                                  0x2

// Register: AT1MISS
#define AT1MISS AT1MISS
extern volatile unsigned short          AT1MISS             __at(0x80E);
#ifndef _LIB_BUILD
asm("AT1MISS equ 080Eh");
#endif

// Register: AT1MISSL
#define AT1MISSL AT1MISSL
extern volatile unsigned char           AT1MISSL            __at(0x80E);
#ifndef _LIB_BUILD
asm("AT1MISSL equ 080Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1MISS0               :1;
        unsigned AT1MISS1               :1;
        unsigned AT1MISS2               :1;
        unsigned AT1MISS3               :1;
        unsigned AT1MISS4               :1;
        unsigned AT1MISS5               :1;
        unsigned AT1MISS6               :1;
        unsigned AT1MISS7               :1;
    };
    struct {
        unsigned MISS0                  :1;
        unsigned MISS1                  :1;
        unsigned MISS2                  :1;
        unsigned MISS3                  :1;
        unsigned MISS4                  :1;
        unsigned MISS5                  :1;
        unsigned MISS6                  :1;
        unsigned MISS7                  :1;
    };
} AT1MISSLbits_t;
extern volatile AT1MISSLbits_t AT1MISSLbits __at(0x80E);
// bitfield macros
#define _AT1MISSL_AT1MISS0_POSN                             0x0
#define _AT1MISSL_AT1MISS0_POSITION                         0x0
#define _AT1MISSL_AT1MISS0_SIZE                             0x1
#define _AT1MISSL_AT1MISS0_LENGTH                           0x1
#define _AT1MISSL_AT1MISS0_MASK                             0x1
#define _AT1MISSL_AT1MISS1_POSN                             0x1
#define _AT1MISSL_AT1MISS1_POSITION                         0x1
#define _AT1MISSL_AT1MISS1_SIZE                             0x1
#define _AT1MISSL_AT1MISS1_LENGTH                           0x1
#define _AT1MISSL_AT1MISS1_MASK                             0x2
#define _AT1MISSL_AT1MISS2_POSN                             0x2
#define _AT1MISSL_AT1MISS2_POSITION                         0x2
#define _AT1MISSL_AT1MISS2_SIZE                             0x1
#define _AT1MISSL_AT1MISS2_LENGTH                           0x1
#define _AT1MISSL_AT1MISS2_MASK                             0x4
#define _AT1MISSL_AT1MISS3_POSN                             0x3
#define _AT1MISSL_AT1MISS3_POSITION                         0x3
#define _AT1MISSL_AT1MISS3_SIZE                             0x1
#define _AT1MISSL_AT1MISS3_LENGTH                           0x1
#define _AT1MISSL_AT1MISS3_MASK                             0x8
#define _AT1MISSL_AT1MISS4_POSN                             0x4
#define _AT1MISSL_AT1MISS4_POSITION                         0x4
#define _AT1MISSL_AT1MISS4_SIZE                             0x1
#define _AT1MISSL_AT1MISS4_LENGTH                           0x1
#define _AT1MISSL_AT1MISS4_MASK                             0x10
#define _AT1MISSL_AT1MISS5_POSN                             0x5
#define _AT1MISSL_AT1MISS5_POSITION                         0x5
#define _AT1MISSL_AT1MISS5_SIZE                             0x1
#define _AT1MISSL_AT1MISS5_LENGTH                           0x1
#define _AT1MISSL_AT1MISS5_MASK                             0x20
#define _AT1MISSL_AT1MISS6_POSN                             0x6
#define _AT1MISSL_AT1MISS6_POSITION                         0x6
#define _AT1MISSL_AT1MISS6_SIZE                             0x1
#define _AT1MISSL_AT1MISS6_LENGTH                           0x1
#define _AT1MISSL_AT1MISS6_MASK                             0x40
#define _AT1MISSL_AT1MISS7_POSN                             0x7
#define _AT1MISSL_AT1MISS7_POSITION                         0x7
#define _AT1MISSL_AT1MISS7_SIZE                             0x1
#define _AT1MISSL_AT1MISS7_LENGTH                           0x1
#define _AT1MISSL_AT1MISS7_MASK                             0x80
#define _AT1MISSL_MISS0_POSN                                0x0
#define _AT1MISSL_MISS0_POSITION                            0x0
#define _AT1MISSL_MISS0_SIZE                                0x1
#define _AT1MISSL_MISS0_LENGTH                              0x1
#define _AT1MISSL_MISS0_MASK                                0x1
#define _AT1MISSL_MISS1_POSN                                0x1
#define _AT1MISSL_MISS1_POSITION                            0x1
#define _AT1MISSL_MISS1_SIZE                                0x1
#define _AT1MISSL_MISS1_LENGTH                              0x1
#define _AT1MISSL_MISS1_MASK                                0x2
#define _AT1MISSL_MISS2_POSN                                0x2
#define _AT1MISSL_MISS2_POSITION                            0x2
#define _AT1MISSL_MISS2_SIZE                                0x1
#define _AT1MISSL_MISS2_LENGTH                              0x1
#define _AT1MISSL_MISS2_MASK                                0x4
#define _AT1MISSL_MISS3_POSN                                0x3
#define _AT1MISSL_MISS3_POSITION                            0x3
#define _AT1MISSL_MISS3_SIZE                                0x1
#define _AT1MISSL_MISS3_LENGTH                              0x1
#define _AT1MISSL_MISS3_MASK                                0x8
#define _AT1MISSL_MISS4_POSN                                0x4
#define _AT1MISSL_MISS4_POSITION                            0x4
#define _AT1MISSL_MISS4_SIZE                                0x1
#define _AT1MISSL_MISS4_LENGTH                              0x1
#define _AT1MISSL_MISS4_MASK                                0x10
#define _AT1MISSL_MISS5_POSN                                0x5
#define _AT1MISSL_MISS5_POSITION                            0x5
#define _AT1MISSL_MISS5_SIZE                                0x1
#define _AT1MISSL_MISS5_LENGTH                              0x1
#define _AT1MISSL_MISS5_MASK                                0x20
#define _AT1MISSL_MISS6_POSN                                0x6
#define _AT1MISSL_MISS6_POSITION                            0x6
#define _AT1MISSL_MISS6_SIZE                                0x1
#define _AT1MISSL_MISS6_LENGTH                              0x1
#define _AT1MISSL_MISS6_MASK                                0x40
#define _AT1MISSL_MISS7_POSN                                0x7
#define _AT1MISSL_MISS7_POSITION                            0x7
#define _AT1MISSL_MISS7_SIZE                                0x1
#define _AT1MISSL_MISS7_LENGTH                              0x1
#define _AT1MISSL_MISS7_MASK                                0x80

