MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1618/mcu.h
extern volatile AT1CC1Hbits_t AT1CC1Hbits __at(0x890);
// bitfield macros
#define _AT1CC1H_AT1CC18_POSN                               0x0
#define _AT1CC1H_AT1CC18_POSITION                           0x0
#define _AT1CC1H_AT1CC18_SIZE                               0x1
#define _AT1CC1H_AT1CC18_LENGTH                             0x1
#define _AT1CC1H_AT1CC18_MASK                               0x1
#define _AT1CC1H_AT1CC19_POSN                               0x1
#define _AT1CC1H_AT1CC19_POSITION                           0x1
#define _AT1CC1H_AT1CC19_SIZE                               0x1
#define _AT1CC1H_AT1CC19_LENGTH                             0x1
#define _AT1CC1H_AT1CC19_MASK                               0x2
#define _AT1CC1H_CC18_POSN                                  0x0
#define _AT1CC1H_CC18_POSITION                              0x0
#define _AT1CC1H_CC18_SIZE                                  0x1
#define _AT1CC1H_CC18_LENGTH                                0x1
#define _AT1CC1H_CC18_MASK                                  0x1
#define _AT1CC1H_CC19_POSN                                  0x1
#define _AT1CC1H_CC19_POSITION                              0x1
#define _AT1CC1H_CC19_SIZE                                  0x1
#define _AT1CC1H_CC19_LENGTH                                0x1
#define _AT1CC1H_CC19_MASK                                  0x2

// Register: AT1CCON1
#define AT1CCON1 AT1CCON1
extern volatile unsigned char           AT1CCON1            __at(0x891);
#ifndef _LIB_BUILD
asm("AT1CCON1 equ 0891h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1CC1MODE             :1;
        unsigned                        :2;
        unsigned AT1CAP1P               :1;
        unsigned AT1CC1POL              :1;
        unsigned                        :2;
        unsigned AT1CC1EN               :1;
    };
    struct {
        unsigned CC1MODE                :1;
        unsigned                        :2;
        unsigned CAP1P                  :1;
        unsigned CC1POL                 :1;
        unsigned                        :2;
        unsigned CC1EN                  :1;
    };
} AT1CCON1bits_t;
extern volatile AT1CCON1bits_t AT1CCON1bits __at(0x891);
// bitfield macros
#define _AT1CCON1_AT1CC1MODE_POSN                           0x0
#define _AT1CCON1_AT1CC1MODE_POSITION                       0x0
#define _AT1CCON1_AT1CC1MODE_SIZE                           0x1
#define _AT1CCON1_AT1CC1MODE_LENGTH                         0x1
#define _AT1CCON1_AT1CC1MODE_MASK                           0x1
#define _AT1CCON1_AT1CAP1P_POSN                             0x3
#define _AT1CCON1_AT1CAP1P_POSITION                         0x3
#define _AT1CCON1_AT1CAP1P_SIZE                             0x1
#define _AT1CCON1_AT1CAP1P_LENGTH                           0x1
#define _AT1CCON1_AT1CAP1P_MASK                             0x8
#define _AT1CCON1_AT1CC1POL_POSN                            0x4
#define _AT1CCON1_AT1CC1POL_POSITION                        0x4
#define _AT1CCON1_AT1CC1POL_SIZE                            0x1
#define _AT1CCON1_AT1CC1POL_LENGTH                          0x1
#define _AT1CCON1_AT1CC1POL_MASK                            0x10
#define _AT1CCON1_AT1CC1EN_POSN                             0x7
#define _AT1CCON1_AT1CC1EN_POSITION                         0x7
#define _AT1CCON1_AT1CC1EN_SIZE                             0x1
#define _AT1CCON1_AT1CC1EN_LENGTH                           0x1
#define _AT1CCON1_AT1CC1EN_MASK                             0x80
#define _AT1CCON1_CC1MODE_POSN                              0x0
#define _AT1CCON1_CC1MODE_POSITION                          0x0
#define _AT1CCON1_CC1MODE_SIZE                              0x1
#define _AT1CCON1_CC1MODE_LENGTH                            0x1
#define _AT1CCON1_CC1MODE_MASK                              0x1
#define _AT1CCON1_CAP1P_POSN                                0x3
#define _AT1CCON1_CAP1P_POSITION                            0x3
#define _AT1CCON1_CAP1P_SIZE                                0x1
#define _AT1CCON1_CAP1P_LENGTH                              0x1
#define _AT1CCON1_CAP1P_MASK                                0x8
#define _AT1CCON1_CC1POL_POSN                               0x4
#define _AT1CCON1_CC1POL_POSITION                           0x4
#define _AT1CCON1_CC1POL_SIZE                               0x1
#define _AT1CCON1_CC1POL_LENGTH                             0x1
#define _AT1CCON1_CC1POL_MASK                               0x10
#define _AT1CCON1_CC1EN_POSN                                0x7
#define _AT1CCON1_CC1EN_POSITION                            0x7
#define _AT1CCON1_CC1EN_SIZE                                0x1
#define _AT1CCON1_CC1EN_LENGTH                              0x1
#define _AT1CCON1_CC1EN_MASK                                0x80

// Register: AT1CSEL2
#define AT1CSEL2 AT1CSEL2
extern volatile unsigned char           AT1CSEL2            __at(0x892);
#ifndef _LIB_BUILD
asm("AT1CSEL2 equ 0892h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1CP2S                :3;
    };
    struct {
        unsigned AT1CP2S0               :1;
        unsigned AT1CP2S1               :1;
        unsigned AT1CP2S2               :1;
    };
    struct {
        unsigned CP2S                   :3;
    };
    struct {
        unsigned CP2S0                  :1;
        unsigned CP2S1                  :1;
        unsigned CP2S2                  :1;
    };
} AT1CSEL2bits_t;
extern volatile AT1CSEL2bits_t AT1CSEL2bits __at(0x892);
// bitfield macros
#define _AT1CSEL2_AT1CP2S_POSN                              0x0
#define _AT1CSEL2_AT1CP2S_POSITION                          0x0
#define _AT1CSEL2_AT1CP2S_SIZE                              0x3
#define _AT1CSEL2_AT1CP2S_LENGTH                            0x3
#define _AT1CSEL2_AT1CP2S_MASK                              0x7
#define _AT1CSEL2_AT1CP2S0_POSN                             0x0
#define _AT1CSEL2_AT1CP2S0_POSITION                         0x0
#define _AT1CSEL2_AT1CP2S0_SIZE                             0x1
#define _AT1CSEL2_AT1CP2S0_LENGTH                           0x1
#define _AT1CSEL2_AT1CP2S0_MASK                             0x1
#define _AT1CSEL2_AT1CP2S1_POSN                             0x1
#define _AT1CSEL2_AT1CP2S1_POSITION                         0x1
#define _AT1CSEL2_AT1CP2S1_SIZE                             0x1
#define _AT1CSEL2_AT1CP2S1_LENGTH                           0x1
#define _AT1CSEL2_AT1CP2S1_MASK                             0x2
#define _AT1CSEL2_AT1CP2S2_POSN                             0x2
#define _AT1CSEL2_AT1CP2S2_POSITION                         0x2
#define _AT1CSEL2_AT1CP2S2_SIZE                             0x1
#define _AT1CSEL2_AT1CP2S2_LENGTH                           0x1
#define _AT1CSEL2_AT1CP2S2_MASK                             0x4
#define _AT1CSEL2_CP2S_POSN                                 0x0
#define _AT1CSEL2_CP2S_POSITION                             0x0
#define _AT1CSEL2_CP2S_SIZE                                 0x3
#define _AT1CSEL2_CP2S_LENGTH                               0x3
#define _AT1CSEL2_CP2S_MASK                                 0x7
#define _AT1CSEL2_CP2S0_POSN                                0x0
#define _AT1CSEL2_CP2S0_POSITION                            0x0
#define _AT1CSEL2_CP2S0_SIZE                                0x1
#define _AT1CSEL2_CP2S0_LENGTH                              0x1
#define _AT1CSEL2_CP2S0_MASK                                0x1
#define _AT1CSEL2_CP2S1_POSN                                0x1
#define _AT1CSEL2_CP2S1_POSITION                            0x1
#define _AT1CSEL2_CP2S1_SIZE                                0x1
#define _AT1CSEL2_CP2S1_LENGTH                              0x1
#define _AT1CSEL2_CP2S1_MASK                                0x2
#define _AT1CSEL2_CP2S2_POSN                                0x2
#define _AT1CSEL2_CP2S2_POSITION                            0x2
#define _AT1CSEL2_CP2S2_SIZE                                0x1
#define _AT1CSEL2_CP2S2_LENGTH                              0x1
#define _AT1CSEL2_CP2S2_MASK                                0x4

// Register: AT1CC2
#define AT1CC2 AT1CC2
extern volatile unsigned short          AT1CC2              __at(0x893);
#ifndef _LIB_BUILD
asm("AT1CC2 equ 0893h");
#endif

