MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1618/mcu.h
// Register: T2CKIPPS
#define T2CKIPPS T2CKIPPS
extern volatile unsigned char           T2CKIPPS            __at(0xE18);
#ifndef _LIB_BUILD
asm("T2CKIPPS equ 0E18h");
#endif
// aliases
extern volatile unsigned char           T2PPS               __at(0xE18);
#ifndef _LIB_BUILD
asm("T2PPS equ 0E18h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T2CKIPPS               :5;
    };
    struct {
        unsigned T2CKIPPS0              :1;
        unsigned T2CKIPPS1              :1;
        unsigned T2CKIPPS2              :1;
        unsigned T2CKIPPS3              :1;
        unsigned T2CKIPPS4              :1;
    };
    struct {
        unsigned T2PPS                  :5;
    };
    struct {
        unsigned T2PPS0                 :1;
        unsigned T2PPS1                 :1;
        unsigned T2PPS2                 :1;
        unsigned T2PPS3                 :1;
        unsigned T2PPS4                 :1;
    };
} T2CKIPPSbits_t;
extern volatile T2CKIPPSbits_t T2CKIPPSbits __at(0xE18);
// bitfield macros
#define _T2CKIPPS_T2CKIPPS_POSN                             0x0
#define _T2CKIPPS_T2CKIPPS_POSITION                         0x0
#define _T2CKIPPS_T2CKIPPS_SIZE                             0x5
#define _T2CKIPPS_T2CKIPPS_LENGTH                           0x5
#define _T2CKIPPS_T2CKIPPS_MASK                             0x1F
#define _T2CKIPPS_T2CKIPPS0_POSN                            0x0
#define _T2CKIPPS_T2CKIPPS0_POSITION                        0x0
#define _T2CKIPPS_T2CKIPPS0_SIZE                            0x1
#define _T2CKIPPS_T2CKIPPS0_LENGTH                          0x1
#define _T2CKIPPS_T2CKIPPS0_MASK                            0x1
#define _T2CKIPPS_T2CKIPPS1_POSN                            0x1
#define _T2CKIPPS_T2CKIPPS1_POSITION                        0x1
#define _T2CKIPPS_T2CKIPPS1_SIZE                            0x1
#define _T2CKIPPS_T2CKIPPS1_LENGTH                          0x1
#define _T2CKIPPS_T2CKIPPS1_MASK                            0x2
#define _T2CKIPPS_T2CKIPPS2_POSN                            0x2
#define _T2CKIPPS_T2CKIPPS2_POSITION                        0x2
#define _T2CKIPPS_T2CKIPPS2_SIZE                            0x1
#define _T2CKIPPS_T2CKIPPS2_LENGTH                          0x1
#define _T2CKIPPS_T2CKIPPS2_MASK                            0x4
#define _T2CKIPPS_T2CKIPPS3_POSN                            0x3
#define _T2CKIPPS_T2CKIPPS3_POSITION                        0x3
#define _T2CKIPPS_T2CKIPPS3_SIZE                            0x1
#define _T2CKIPPS_T2CKIPPS3_LENGTH                          0x1
#define _T2CKIPPS_T2CKIPPS3_MASK                            0x8
#define _T2CKIPPS_T2CKIPPS4_POSN                            0x4
#define _T2CKIPPS_T2CKIPPS4_POSITION                        0x4
#define _T2CKIPPS_T2CKIPPS4_SIZE                            0x1
#define _T2CKIPPS_T2CKIPPS4_LENGTH                          0x1
#define _T2CKIPPS_T2CKIPPS4_MASK                            0x10
#define _T2CKIPPS_T2PPS_POSN                                0x0
#define _T2CKIPPS_T2PPS_POSITION                            0x0
#define _T2CKIPPS_T2PPS_SIZE                                0x5
#define _T2CKIPPS_T2PPS_LENGTH                              0x5
#define _T2CKIPPS_T2PPS_MASK                                0x1F
#define _T2CKIPPS_T2PPS0_POSN                               0x0
#define _T2CKIPPS_T2PPS0_POSITION                           0x0
#define _T2CKIPPS_T2PPS0_SIZE                               0x1
#define _T2CKIPPS_T2PPS0_LENGTH                             0x1
#define _T2CKIPPS_T2PPS0_MASK                               0x1
#define _T2CKIPPS_T2PPS1_POSN                               0x1
#define _T2CKIPPS_T2PPS1_POSITION                           0x1
#define _T2CKIPPS_T2PPS1_SIZE                               0x1
#define _T2CKIPPS_T2PPS1_LENGTH                             0x1
#define _T2CKIPPS_T2PPS1_MASK                               0x2
#define _T2CKIPPS_T2PPS2_POSN                               0x2
#define _T2CKIPPS_T2PPS2_POSITION                           0x2
#define _T2CKIPPS_T2PPS2_SIZE                               0x1
#define _T2CKIPPS_T2PPS2_LENGTH                             0x1
#define _T2CKIPPS_T2PPS2_MASK                               0x4
#define _T2CKIPPS_T2PPS3_POSN                               0x3
#define _T2CKIPPS_T2PPS3_POSITION                           0x3
#define _T2CKIPPS_T2PPS3_SIZE                               0x1
#define _T2CKIPPS_T2PPS3_LENGTH                             0x1
#define _T2CKIPPS_T2PPS3_MASK                               0x8
#define _T2CKIPPS_T2PPS4_POSN                               0x4
#define _T2CKIPPS_T2PPS4_POSITION                           0x4
#define _T2CKIPPS_T2PPS4_SIZE                               0x1
#define _T2CKIPPS_T2PPS4_LENGTH                             0x1
#define _T2CKIPPS_T2PPS4_MASK                               0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned T2CKIPPS               :5;
    };
    struct {
        unsigned T2CKIPPS0              :1;
        unsigned T2CKIPPS1              :1;
        unsigned T2CKIPPS2              :1;
        unsigned T2CKIPPS3              :1;
        unsigned T2CKIPPS4              :1;
    };
    struct {
        unsigned T2PPS                  :5;
    };
    struct {
        unsigned T2PPS0                 :1;
        unsigned T2PPS1                 :1;
        unsigned T2PPS2                 :1;
        unsigned T2PPS3                 :1;
        unsigned T2PPS4                 :1;
    };
} T2PPSbits_t;
extern volatile T2PPSbits_t T2PPSbits __at(0xE18);
// bitfield macros
#define _T2PPS_T2CKIPPS_POSN                                0x0
#define _T2PPS_T2CKIPPS_POSITION                            0x0
#define _T2PPS_T2CKIPPS_SIZE                                0x5
#define _T2PPS_T2CKIPPS_LENGTH                              0x5
#define _T2PPS_T2CKIPPS_MASK                                0x1F
#define _T2PPS_T2CKIPPS0_POSN                               0x0
#define _T2PPS_T2CKIPPS0_POSITION                           0x0
#define _T2PPS_T2CKIPPS0_SIZE                               0x1
#define _T2PPS_T2CKIPPS0_LENGTH                             0x1
#define _T2PPS_T2CKIPPS0_MASK                               0x1
#define _T2PPS_T2CKIPPS1_POSN                               0x1
#define _T2PPS_T2CKIPPS1_POSITION                           0x1
#define _T2PPS_T2CKIPPS1_SIZE                               0x1
#define _T2PPS_T2CKIPPS1_LENGTH                             0x1
#define _T2PPS_T2CKIPPS1_MASK                               0x2
#define _T2PPS_T2CKIPPS2_POSN                               0x2
#define _T2PPS_T2CKIPPS2_POSITION                           0x2
#define _T2PPS_T2CKIPPS2_SIZE                               0x1
#define _T2PPS_T2CKIPPS2_LENGTH                             0x1
#define _T2PPS_T2CKIPPS2_MASK                               0x4
#define _T2PPS_T2CKIPPS3_POSN                               0x3
#define _T2PPS_T2CKIPPS3_POSITION                           0x3
#define _T2PPS_T2CKIPPS3_SIZE                               0x1
#define _T2PPS_T2CKIPPS3_LENGTH                             0x1
#define _T2PPS_T2CKIPPS3_MASK                               0x8
#define _T2PPS_T2CKIPPS4_POSN                               0x4
#define _T2PPS_T2CKIPPS4_POSITION                           0x4
#define _T2PPS_T2CKIPPS4_SIZE                               0x1
#define _T2PPS_T2CKIPPS4_LENGTH                             0x1
#define _T2PPS_T2CKIPPS4_MASK                               0x10
#define _T2PPS_T2PPS_POSN                                   0x0
#define _T2PPS_T2PPS_POSITION                               0x0
#define _T2PPS_T2PPS_SIZE                                   0x5
#define _T2PPS_T2PPS_LENGTH                                 0x5
#define _T2PPS_T2PPS_MASK                                   0x1F
#define _T2PPS_T2PPS0_POSN                                  0x0
#define _T2PPS_T2PPS0_POSITION                              0x0
#define _T2PPS_T2PPS0_SIZE                                  0x1
#define _T2PPS_T2PPS0_LENGTH                                0x1
#define _T2PPS_T2PPS0_MASK                                  0x1
#define _T2PPS_T2PPS1_POSN                                  0x1
#define _T2PPS_T2PPS1_POSITION                              0x1
#define _T2PPS_T2PPS1_SIZE                                  0x1
#define _T2PPS_T2PPS1_LENGTH                                0x1
#define _T2PPS_T2PPS1_MASK                                  0x2
#define _T2PPS_T2PPS2_POSN                                  0x2
#define _T2PPS_T2PPS2_POSITION                              0x2
#define _T2PPS_T2PPS2_SIZE                                  0x1
#define _T2PPS_T2PPS2_LENGTH                                0x1
#define _T2PPS_T2PPS2_MASK                                  0x4
#define _T2PPS_T2PPS3_POSN                                  0x3
#define _T2PPS_T2PPS3_POSITION                              0x3
#define _T2PPS_T2PPS3_SIZE                                  0x1
#define _T2PPS_T2PPS3_LENGTH                                0x1
#define _T2PPS_T2PPS3_MASK                                  0x8
#define _T2PPS_T2PPS4_POSN                                  0x4
#define _T2PPS_T2PPS4_POSITION                              0x4
#define _T2PPS_T2PPS4_SIZE                                  0x1
#define _T2PPS_T2PPS4_LENGTH                                0x1
#define _T2PPS_T2PPS4_MASK                                  0x10

