MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1618/mcu.h
extern volatile __bit                   CCP2CTS2            __at(0x14DA);	// @ (0x29B * 8 + 2)
#define                                 CCP2CTS2_bit        _BIT_ACCESS(CCP2CAP,2)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x14D7);	// @ (0x29A * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x14D4);	// @ (0x29A * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x488);	// @ (0x91 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x88);	// @ (0x11 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x14D0);	// @ (0x29A * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x14D1);	// @ (0x29A * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x14D2);	// @ (0x29A * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x14D3);	// @ (0x29A * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x14D5);	// @ (0x29A * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCP2PPS<CCP2PPS0>
extern volatile __bit                   CCP2PPS0            __at(0x70A8);	// @ (0xE15 * 8 + 0)
#define                                 CCP2PPS0_bit        _BIT_ACCESS(CCP2PPS,0)
// CCP2PPS<CCP2PPS1>
extern volatile __bit                   CCP2PPS1            __at(0x70A9);	// @ (0xE15 * 8 + 1)
#define                                 CCP2PPS1_bit        _BIT_ACCESS(CCP2PPS,1)
// CCP2PPS<CCP2PPS2>
extern volatile __bit                   CCP2PPS2            __at(0x70AA);	// @ (0xE15 * 8 + 2)
#define                                 CCP2PPS2_bit        _BIT_ACCESS(CCP2PPS,2)
// CCP2PPS<CCP2PPS3>
extern volatile __bit                   CCP2PPS3            __at(0x70AB);	// @ (0xE15 * 8 + 3)
#define                                 CCP2PPS3_bit        _BIT_ACCESS(CCP2PPS,3)
// CCP2PPS<CCP2PPS4>
extern volatile __bit                   CCP2PPS4            __at(0x70AC);	// @ (0xE15 * 8 + 4)
#define                                 CCP2PPS4_bit        _BIT_ACCESS(CCP2PPS,4)
// CCPTMRS<CCP2TSEL0>
extern volatile __bit                   CCP2TSEL0           __at(0x14F2);	// @ (0x29E * 8 + 2)
#define                                 CCP2TSEL0_bit       _BIT_ACCESS(CCPTMRS,2)
// CCPTMRS<CCP2TSEL1>
extern volatile __bit                   CCP2TSEL1           __at(0x14F3);	// @ (0x29E * 8 + 3)
#define                                 CCP2TSEL1_bit       _BIT_ACCESS(CCPTMRS,3)
// AT1CC2L<CCW5>
extern volatile __bit                   CCW5                __at(0x449D);	// @ (0x893 * 8 + 5)
#define                                 CCW5_bit            _BIT_ACCESS(AT1CC2L,5)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x8BA);	// @ (0x117 * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x8BB);	// @ (0x117 * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// PMCON1<CFGS>
extern volatile __bit                   CFGS                __at(0xCAE);	// @ (0x195 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(PMCON1,6)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x4EA);	// @ (0x9D * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x4EB);	// @ (0x9D * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x4EC);	// @ (0x9D * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x4ED);	// @ (0x9D * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON0<CHS4>
extern volatile __bit                   CHS4                __at(0x4EE);	// @ (0x9D * 8 + 6)
#define                                 CHS4_bit            _BIT_ACCESS(ADCON0,6)
// SSP1STAT<CKE>
extern volatile __bit                   CKE                 __at(0x10A6);	// @ (0x214 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSP1STAT,6)
// SSP1CON1<CKP>
extern volatile __bit                   CKP                 __at(0x10AC);	// @ (0x215 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSP1CON1,4)
// CKPPS<CKPPS0>
extern volatile __bit                   CKPPS0              __at(0x7128);	// @ (0xE25 * 8 + 0)
#define                                 CKPPS0_bit          _BIT_ACCESS(CKPPS,0)
// CKPPS<CKPPS1>
extern volatile __bit                   CKPPS1              __at(0x7129);	// @ (0xE25 * 8 + 1)
#define                                 CKPPS1_bit          _BIT_ACCESS(CKPPS,1)
// CKPPS<CKPPS2>
extern volatile __bit                   CKPPS2              __at(0x712A);	// @ (0xE25 * 8 + 2)
#define                                 CKPPS2_bit          _BIT_ACCESS(CKPPS,2)
// CKPPS<CKPPS3>
extern volatile __bit                   CKPPS3              __at(0x712B);	// @ (0xE25 * 8 + 3)
#define                                 CKPPS3_bit          _BIT_ACCESS(CKPPS,3)
// CKPPS<CKPPS4>
extern volatile __bit                   CKPPS4              __at(0x712C);	// @ (0xE25 * 8 + 4)
#define                                 CKPPS4_bit          _BIT_ACCESS(CKPPS,4)
// PIE3<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x490);	// @ (0x92 * 8 + 0)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x90);	// @ (0x12 * 8 + 0)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR3,0)
// PIE3<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x491);	// @ (0x92 * 8 + 1)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x91);	// @ (0x12 * 8 + 1)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR3,1)
// CLCIN0PPS<CLCIN0PPS0>
extern volatile __bit                   CLCIN0PPS0          __at(0x7140);	// @ (0xE28 * 8 + 0)
#define                                 CLCIN0PPS0_bit      _BIT_ACCESS(CLCIN0PPS,0)
// CLCIN0PPS<CLCIN0PPS1>
extern volatile __bit                   CLCIN0PPS1          __at(0x7141);	// @ (0xE28 * 8 + 1)
#define                                 CLCIN0PPS1_bit      _BIT_ACCESS(CLCIN0PPS,1)
// CLCIN0PPS<CLCIN0PPS2>
extern volatile __bit                   CLCIN0PPS2          __at(0x7142);	// @ (0xE28 * 8 + 2)
#define                                 CLCIN0PPS2_bit      _BIT_ACCESS(CLCIN0PPS,2)
// CLCIN0PPS<CLCIN0PPS3>
extern volatile __bit                   CLCIN0PPS3          __at(0x7143);	// @ (0xE28 * 8 + 3)
#define                                 CLCIN0PPS3_bit      _BIT_ACCESS(CLCIN0PPS,3)
// CLCIN0PPS<CLCIN0PPS4>
extern volatile __bit                   CLCIN0PPS4          __at(0x7144);	// @ (0xE28 * 8 + 4)
#define                                 CLCIN0PPS4_bit      _BIT_ACCESS(CLCIN0PPS,4)
// CLCIN1PPS<CLCIN1PPS0>
extern volatile __bit                   CLCIN1PPS0          __at(0x7148);	// @ (0xE29 * 8 + 0)
#define                                 CLCIN1PPS0_bit      _BIT_ACCESS(CLCIN1PPS,0)
// CLCIN1PPS<CLCIN1PPS1>
extern volatile __bit                   CLCIN1PPS1          __at(0x7149);	// @ (0xE29 * 8 + 1)
#define                                 CLCIN1PPS1_bit      _BIT_ACCESS(CLCIN1PPS,1)
// CLCIN1PPS<CLCIN1PPS2>
extern volatile __bit                   CLCIN1PPS2          __at(0x714A);	// @ (0xE29 * 8 + 2)
#define                                 CLCIN1PPS2_bit      _BIT_ACCESS(CLCIN1PPS,2)
// CLCIN1PPS<CLCIN1PPS3>
extern volatile __bit                   CLCIN1PPS3          __at(0x714B);	// @ (0xE29 * 8 + 3)
#define                                 CLCIN1PPS3_bit      _BIT_ACCESS(CLCIN1PPS,3)
// CLCIN1PPS<CLCIN1PPS4>
extern volatile __bit                   CLCIN1PPS4          __at(0x714C);	// @ (0xE29 * 8 + 4)
#define                                 CLCIN1PPS4_bit      _BIT_ACCESS(CLCIN1PPS,4)
// CLCIN2PPS<CLCIN2PPS0>
extern volatile __bit                   CLCIN2PPS0          __at(0x7150);	// @ (0xE2A * 8 + 0)
#define                                 CLCIN2PPS0_bit      _BIT_ACCESS(CLCIN2PPS,0)
// CLCIN2PPS<CLCIN2PPS1>
extern volatile __bit                   CLCIN2PPS1          __at(0x7151);	// @ (0xE2A * 8 + 1)
#define                                 CLCIN2PPS1_bit      _BIT_ACCESS(CLCIN2PPS,1)
// CLCIN2PPS<CLCIN2PPS2>
extern volatile __bit                   CLCIN2PPS2          __at(0x7152);	// @ (0xE2A * 8 + 2)
#define                                 CLCIN2PPS2_bit      _BIT_ACCESS(CLCIN2PPS,2)
// CLCIN2PPS<CLCIN2PPS3>
extern volatile __bit                   CLCIN2PPS3          __at(0x7153);	// @ (0xE2A * 8 + 3)
#define                                 CLCIN2PPS3_bit      _BIT_ACCESS(CLCIN2PPS,3)
// CLCIN2PPS<CLCIN2PPS4>
extern volatile __bit                   CLCIN2PPS4          __at(0x7154);	// @ (0xE2A * 8 + 4)
#define                                 CLCIN2PPS4_bit      _BIT_ACCESS(CLCIN2PPS,4)
// CLCIN3PPS<CLCIN3PPS0>
extern volatile __bit                   CLCIN3PPS0          __at(0x7158);	// @ (0xE2B * 8 + 0)
#define                                 CLCIN3PPS0_bit      _BIT_ACCESS(CLCIN3PPS,0)
// CLCIN3PPS<CLCIN3PPS1>
extern volatile __bit                   CLCIN3PPS1          __at(0x7159);	// @ (0xE2B * 8 + 1)
#define                                 CLCIN3PPS1_bit      _BIT_ACCESS(CLCIN3PPS,1)
// CLCIN3PPS<CLCIN3PPS2>
extern volatile __bit                   CLCIN3PPS2          __at(0x715A);	// @ (0xE2B * 8 + 2)
#define                                 CLCIN3PPS2_bit      _BIT_ACCESS(CLCIN3PPS,2)
// CLCIN3PPS<CLCIN3PPS3>
extern volatile __bit                   CLCIN3PPS3          __at(0x715B);	// @ (0xE2B * 8 + 3)
#define                                 CLCIN3PPS3_bit      _BIT_ACCESS(CLCIN3PPS,3)
// CLCIN3PPS<CLCIN3PPS4>
extern volatile __bit                   CLCIN3PPS4          __at(0x715C);	// @ (0xE2B * 8 + 4)
#define                                 CLCIN3PPS4_bit      _BIT_ACCESS(CLCIN3PPS,4)
// AT1CSEL1<CP1S0>
extern volatile __bit                   CP1S0               __at(0x4470);	// @ (0x88E * 8 + 0)
#define                                 CP1S0_bit           _BIT_ACCESS(AT1CSEL1,0)
// AT1CSEL1<CP1S1>
extern volatile __bit                   CP1S1               __at(0x4471);	// @ (0x88E * 8 + 1)
#define                                 CP1S1_bit           _BIT_ACCESS(AT1CSEL1,1)
// AT1CSEL1<CP1S2>
extern volatile __bit                   CP1S2               __at(0x4472);	// @ (0x88E * 8 + 2)
#define                                 CP1S2_bit           _BIT_ACCESS(AT1CSEL1,2)
// AT1CSEL2<CP2S0>
extern volatile __bit                   CP2S0               __at(0x4490);	// @ (0x892 * 8 + 0)
#define                                 CP2S0_bit           _BIT_ACCESS(AT1CSEL2,0)
// AT1CSEL2<CP2S1>
extern volatile __bit                   CP2S1               __at(0x4491);	// @ (0x892 * 8 + 1)
#define                                 CP2S1_bit           _BIT_ACCESS(AT1CSEL2,1)
// AT1CSEL2<CP2S2>
extern volatile __bit                   CP2S2               __at(0x4492);	// @ (0x892 * 8 + 2)
#define                                 CP2S2_bit           _BIT_ACCESS(AT1CSEL2,2)
// AT1CSEL3<CP3S0>
extern volatile __bit                   CP3S0               __at(0x44B0);	// @ (0x896 * 8 + 0)
#define                                 CP3S0_bit           _BIT_ACCESS(AT1CSEL3,0)
// AT1CSEL3<CP3S1>
extern volatile __bit                   CP3S1               __at(0x44B1);	// @ (0x896 * 8 + 1)
#define                                 CP3S1_bit           _BIT_ACCESS(AT1CSEL3,1)
// AT1CSEL3<CP3S2>
extern volatile __bit                   CP3S2               __at(0x44B2);	// @ (0x896 * 8 + 2)
#define                                 CP3S2_bit           _BIT_ACCESS(AT1CSEL3,2)
// CRCACCL<CRCACC0>
extern volatile __bit                   CRCACC0             __at(0x3C98);	// @ (0x793 * 8 + 0)
#define                                 CRCACC0_bit         _BIT_ACCESS(CRCACCL,0)
// CRCACCL<CRCACC1>
extern volatile __bit                   CRCACC1             __at(0x3C99);	// @ (0x793 * 8 + 1)
#define                                 CRCACC1_bit         _BIT_ACCESS(CRCACCL,1)
// CRCACCH<CRCACC10>
extern volatile __bit                   CRCACC10            __at(0x3CA2);	// @ (0x794 * 8 + 2)
#define                                 CRCACC10_bit        _BIT_ACCESS(CRCACCH,2)
// CRCACCH<CRCACC11>
extern volatile __bit                   CRCACC11            __at(0x3CA3);	// @ (0x794 * 8 + 3)
#define                                 CRCACC11_bit        _BIT_ACCESS(CRCACCH,3)
// CRCACCH<CRCACC12>
extern volatile __bit                   CRCACC12            __at(0x3CA4);	// @ (0x794 * 8 + 4)
#define                                 CRCACC12_bit        _BIT_ACCESS(CRCACCH,4)
// CRCACCH<CRCACC13>
extern volatile __bit                   CRCACC13            __at(0x3CA5);	// @ (0x794 * 8 + 5)
#define                                 CRCACC13_bit        _BIT_ACCESS(CRCACCH,5)
// CRCACCH<CRCACC14>
extern volatile __bit                   CRCACC14            __at(0x3CA6);	// @ (0x794 * 8 + 6)
#define                                 CRCACC14_bit        _BIT_ACCESS(CRCACCH,6)
// CRCACCH<CRCACC15>
extern volatile __bit                   CRCACC15            __at(0x3CA7);	// @ (0x794 * 8 + 7)
#define                                 CRCACC15_bit        _BIT_ACCESS(CRCACCH,7)
// CRCACCL<CRCACC2>
extern volatile __bit                   CRCACC2             __at(0x3C9A);	// @ (0x793 * 8 + 2)
#define                                 CRCACC2_bit         _BIT_ACCESS(CRCACCL,2)
// CRCACCL<CRCACC3>
extern volatile __bit                   CRCACC3             __at(0x3C9B);	// @ (0x793 * 8 + 3)
#define                                 CRCACC3_bit         _BIT_ACCESS(CRCACCL,3)
// CRCACCL<CRCACC4>
extern volatile __bit                   CRCACC4             __at(0x3C9C);	// @ (0x793 * 8 + 4)
#define                                 CRCACC4_bit         _BIT_ACCESS(CRCACCL,4)
// CRCACCL<CRCACC5>
extern volatile __bit                   CRCACC5             __at(0x3C9D);	// @ (0x793 * 8 + 5)
#define                                 CRCACC5_bit         _BIT_ACCESS(CRCACCL,5)
// CRCACCL<CRCACC6>
extern volatile __bit                   CRCACC6             __at(0x3C9E);	// @ (0x793 * 8 + 6)
#define                                 CRCACC6_bit         _BIT_ACCESS(CRCACCL,6)
// CRCACCL<CRCACC7>
extern volatile __bit                   CRCACC7             __at(0x3C9F);	// @ (0x793 * 8 + 7)
#define                                 CRCACC7_bit         _BIT_ACCESS(CRCACCL,7)
// CRCACCH<CRCACC8>
extern volatile __bit                   CRCACC8             __at(0x3CA0);	// @ (0x794 * 8 + 0)
#define                                 CRCACC8_bit         _BIT_ACCESS(CRCACCH,0)
// CRCACCH<CRCACC9>
extern volatile __bit                   CRCACC9             __at(0x3CA1);	// @ (0x794 * 8 + 1)
#define                                 CRCACC9_bit         _BIT_ACCESS(CRCACCH,1)
// CRCCON0<CRCACCM>
extern volatile __bit                   CRCACCM             __at(0x3CCC);	// @ (0x799 * 8 + 4)
#define                                 CRCACCM_bit         _BIT_ACCESS(CRCCON0,4)
// CRCCON0<CRCBUSY>
extern volatile __bit                   CRCBUSY             __at(0x3CCD);	// @ (0x799 * 8 + 5)
#define                                 CRCBUSY_bit         _BIT_ACCESS(CRCCON0,5)
// CRCDATL<CRCDAT0>
extern volatile __bit                   CRCDAT0             __at(0x3C88);	// @ (0x791 * 8 + 0)
#define                                 CRCDAT0_bit         _BIT_ACCESS(CRCDATL,0)
// CRCDATL<CRCDAT1>
extern volatile __bit                   CRCDAT1             __at(0x3C89);	// @ (0x791 * 8 + 1)
#define                                 CRCDAT1_bit         _BIT_ACCESS(CRCDATL,1)
// CRCDATH<CRCDAT10>
extern volatile __bit                   CRCDAT10            __at(0x3C92);	// @ (0x792 * 8 + 2)
#define                                 CRCDAT10_bit        _BIT_ACCESS(CRCDATH,2)
// CRCDATH<CRCDAT11>
extern volatile __bit                   CRCDAT11            __at(0x3C93);	// @ (0x792 * 8 + 3)
#define                                 CRCDAT11_bit        _BIT_ACCESS(CRCDATH,3)
// CRCDATH<CRCDAT12>
extern volatile __bit                   CRCDAT12            __at(0x3C94);	// @ (0x792 * 8 + 4)
#define                                 CRCDAT12_bit        _BIT_ACCESS(CRCDATH,4)
// CRCDATH<CRCDAT13>
extern volatile __bit                   CRCDAT13            __at(0x3C95);	// @ (0x792 * 8 + 5)
#define                                 CRCDAT13_bit        _BIT_ACCESS(CRCDATH,5)
// CRCDATH<CRCDAT14>
extern volatile __bit                   CRCDAT14            __at(0x3C96);	// @ (0x792 * 8 + 6)
#define                                 CRCDAT14_bit        _BIT_ACCESS(CRCDATH,6)
// CRCDATH<CRCDAT15>
extern volatile __bit                   CRCDAT15            __at(0x3C97);	// @ (0x792 * 8 + 7)
#define                                 CRCDAT15_bit        _BIT_ACCESS(CRCDATH,7)
// CRCDATL<CRCDAT2>
extern volatile __bit                   CRCDAT2             __at(0x3C8A);	// @ (0x791 * 8 + 2)
#define                                 CRCDAT2_bit         _BIT_ACCESS(CRCDATL,2)
// CRCDATL<CRCDAT3>
extern volatile __bit                   CRCDAT3             __at(0x3C8B);	// @ (0x791 * 8 + 3)
#define                                 CRCDAT3_bit         _BIT_ACCESS(CRCDATL,3)
// CRCDATL<CRCDAT4>
extern volatile __bit                   CRCDAT4             __at(0x3C8C);	// @ (0x791 * 8 + 4)
#define                                 CRCDAT4_bit         _BIT_ACCESS(CRCDATL,4)
// CRCDATL<CRCDAT5>
extern volatile __bit                   CRCDAT5             __at(0x3C8D);	// @ (0x791 * 8 + 5)
#define                                 CRCDAT5_bit         _BIT_ACCESS(CRCDATL,5)
// CRCDATL<CRCDAT6>
extern volatile __bit                   CRCDAT6             __at(0x3C8E);	// @ (0x791 * 8 + 6)
#define                                 CRCDAT6_bit         _BIT_ACCESS(CRCDATL,6)
// CRCDATH<CRCDAT8>
extern volatile __bit                   CRCDAT8             __at(0x3C90);	// @ (0x792 * 8 + 0)
#define                                 CRCDAT8_bit         _BIT_ACCESS(CRCDATH,0)
// CRCDATH<CRCDAT9>
extern volatile __bit                   CRCDAT9             __at(0x3C91);	// @ (0x792 * 8 + 1)
#define                                 CRCDAT9_bit         _BIT_ACCESS(CRCDATH,1)
// CRCCON1<CRCDLEN0>
extern volatile __bit                   CRCDLEN0            __at(0x3CD4);	// @ (0x79A * 8 + 4)
#define                                 CRCDLEN0_bit        _BIT_ACCESS(CRCCON1,4)
// CRCCON1<CRCDLEN1>
extern volatile __bit                   CRCDLEN1            __at(0x3CD5);	// @ (0x79A * 8 + 5)
#define                                 CRCDLEN1_bit        _BIT_ACCESS(CRCCON1,5)
// CRCCON1<CRCDLEN2>
extern volatile __bit                   CRCDLEN2            __at(0x3CD6);	// @ (0x79A * 8 + 6)
#define                                 CRCDLEN2_bit        _BIT_ACCESS(CRCCON1,6)
// CRCCON1<CRCDLEN3>
extern volatile __bit                   CRCDLEN3            __at(0x3CD7);	// @ (0x79A * 8 + 7)
#define                                 CRCDLEN3_bit        _BIT_ACCESS(CRCCON1,7)
// CRCCON0<CRCEN>
extern volatile __bit                   CRCEN               __at(0x3CCF);	// @ (0x799 * 8 + 7)
#define                                 CRCEN_bit           _BIT_ACCESS(CRCCON0,7)
// CRCCON0<CRCFULL>
extern volatile __bit                   CRCFULL             __at(0x3CC8);	// @ (0x799 * 8 + 0)
#define                                 CRCFULL_bit         _BIT_ACCESS(CRCCON0,0)
// CRCCON0<CRCGO>
extern volatile __bit                   CRCGO               __at(0x3CCE);	// @ (0x799 * 8 + 6)
#define                                 CRCGO_bit           _BIT_ACCESS(CRCCON0,6)
// PIE4<CRCIE>
extern volatile __bit                   CRCIE               __at(0x49E);	// @ (0x93 * 8 + 6)
#define                                 CRCIE_bit           _BIT_ACCESS(PIE4,6)
// PIR4<CRCIF>
extern volatile __bit                   CRCIF               __at(0x9E);	// @ (0x13 * 8 + 6)
#define                                 CRCIF_bit           _BIT_ACCESS(PIR4,6)
// CRCCON1<CRCPLEN0>
extern volatile __bit                   CRCPLEN0            __at(0x3CD0);	// @ (0x79A * 8 + 0)
#define                                 CRCPLEN0_bit        _BIT_ACCESS(CRCCON1,0)
// CRCCON1<CRCPLEN1>
extern volatile __bit                   CRCPLEN1            __at(0x3CD1);	// @ (0x79A * 8 + 1)
#define                                 CRCPLEN1_bit        _BIT_ACCESS(CRCCON1,1)
// CRCCON1<CRCPLEN2>
extern volatile __bit                   CRCPLEN2            __at(0x3CD2);	// @ (0x79A * 8 + 2)
#define                                 CRCPLEN2_bit        _BIT_ACCESS(CRCCON1,2)
// CRCCON1<CRCPLEN3>
extern volatile __bit                   CRCPLEN3            __at(0x3CD3);	// @ (0x79A * 8 + 3)
#define                                 CRCPLEN3_bit        _BIT_ACCESS(CRCCON1,3)
// CRCSHIFTL<CRCSHIFT0>
extern volatile __bit                   CRCSHIFT0           __at(0x3CA8);	// @ (0x795 * 8 + 0)
#define                                 CRCSHIFT0_bit       _BIT_ACCESS(CRCSHIFTL,0)
// CRCSHIFTL<CRCSHIFT1>
extern volatile __bit                   CRCSHIFT1           __at(0x3CA9);	// @ (0x795 * 8 + 1)
#define                                 CRCSHIFT1_bit       _BIT_ACCESS(CRCSHIFTL,1)
// CRCSHIFTH<CRCSHIFT10>
extern volatile __bit                   CRCSHIFT10          __at(0x3CB2);	// @ (0x796 * 8 + 2)
#define                                 CRCSHIFT10_bit      _BIT_ACCESS(CRCSHIFTH,2)
// CRCSHIFTH<CRCSHIFT11>
extern volatile __bit                   CRCSHIFT11          __at(0x3CB3);	// @ (0x796 * 8 + 3)
#define                                 CRCSHIFT11_bit      _BIT_ACCESS(CRCSHIFTH,3)
// CRCSHIFTH<CRCSHIFT12>
extern volatile __bit                   CRCSHIFT12          __at(0x3CB4);	// @ (0x796 * 8 + 4)
#define                                 CRCSHIFT12_bit      _BIT_ACCESS(CRCSHIFTH,4)
// CRCSHIFTH<CRCSHIFT13>
extern volatile __bit                   CRCSHIFT13          __at(0x3CB5);	// @ (0x796 * 8 + 5)
#define                                 CRCSHIFT13_bit      _BIT_ACCESS(CRCSHIFTH,5)
// CRCSHIFTH<CRCSHIFT14>
extern volatile __bit                   CRCSHIFT14          __at(0x3CB6);	// @ (0x796 * 8 + 6)
#define                                 CRCSHIFT14_bit      _BIT_ACCESS(CRCSHIFTH,6)
// CRCSHIFTH<CRCSHIFT15>
extern volatile __bit                   CRCSHIFT15          __at(0x3CB7);	// @ (0x796 * 8 + 7)
#define                                 CRCSHIFT15_bit      _BIT_ACCESS(CRCSHIFTH,7)
// CRCSHIFTL<CRCSHIFT2>
extern volatile __bit                   CRCSHIFT2           __at(0x3CAA);	// @ (0x795 * 8 + 2)
