MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1618/mcu.h
// PID1INH<PID1IN8>
extern volatile __bit                   PID1IN8             __at(0x2C78);	// @ (0x58F * 8 + 0)
#define                                 PID1IN8_bit         _BIT_ACCESS(PID1INH,0)
// PID1INH<PID1IN9>
extern volatile __bit                   PID1IN9             __at(0x2C79);	// @ (0x58F * 8 + 1)
#define                                 PID1IN9_bit         _BIT_ACCESS(PID1INH,1)
// PID1K1L<PID1K10>
extern volatile __bit                   PID1K10             __at(0x2C80);	// @ (0x590 * 8 + 0)
#define                                 PID1K10_bit         _BIT_ACCESS(PID1K1L,0)
// PID1K1L<PID1K11>
extern volatile __bit                   PID1K11             __at(0x2C81);	// @ (0x590 * 8 + 1)
#define                                 PID1K11_bit         _BIT_ACCESS(PID1K1L,1)
// PID1K1H<PID1K110>
extern volatile __bit                   PID1K110            __at(0x2C8A);	// @ (0x591 * 8 + 2)
#define                                 PID1K110_bit        _BIT_ACCESS(PID1K1H,2)
// PID1K1H<PID1K111>
extern volatile __bit                   PID1K111            __at(0x2C8B);	// @ (0x591 * 8 + 3)
#define                                 PID1K111_bit        _BIT_ACCESS(PID1K1H,3)
// PID1K1H<PID1K112>
extern volatile __bit                   PID1K112            __at(0x2C8C);	// @ (0x591 * 8 + 4)
#define                                 PID1K112_bit        _BIT_ACCESS(PID1K1H,4)
// PID1K1H<PID1K113>
extern volatile __bit                   PID1K113            __at(0x2C8D);	// @ (0x591 * 8 + 5)
#define                                 PID1K113_bit        _BIT_ACCESS(PID1K1H,5)
// PID1K1H<PID1K114>
extern volatile __bit                   PID1K114            __at(0x2C8E);	// @ (0x591 * 8 + 6)
#define                                 PID1K114_bit        _BIT_ACCESS(PID1K1H,6)
// PID1K1H<PID1K115>
extern volatile __bit                   PID1K115            __at(0x2C8F);	// @ (0x591 * 8 + 7)
#define                                 PID1K115_bit        _BIT_ACCESS(PID1K1H,7)
// PID1K1L<PID1K12>
extern volatile __bit                   PID1K12             __at(0x2C82);	// @ (0x590 * 8 + 2)
#define                                 PID1K12_bit         _BIT_ACCESS(PID1K1L,2)
// PID1K1L<PID1K13>
extern volatile __bit                   PID1K13             __at(0x2C83);	// @ (0x590 * 8 + 3)
#define                                 PID1K13_bit         _BIT_ACCESS(PID1K1L,3)
// PID1K1L<PID1K14>
extern volatile __bit                   PID1K14             __at(0x2C84);	// @ (0x590 * 8 + 4)
#define                                 PID1K14_bit         _BIT_ACCESS(PID1K1L,4)
// PID1K1L<PID1K15>
extern volatile __bit                   PID1K15             __at(0x2C85);	// @ (0x590 * 8 + 5)
#define                                 PID1K15_bit         _BIT_ACCESS(PID1K1L,5)
// PID1K1L<PID1K16>
extern volatile __bit                   PID1K16             __at(0x2C86);	// @ (0x590 * 8 + 6)
#define                                 PID1K16_bit         _BIT_ACCESS(PID1K1L,6)
// PID1K1L<PID1K17>
extern volatile __bit                   PID1K17             __at(0x2C87);	// @ (0x590 * 8 + 7)
#define                                 PID1K17_bit         _BIT_ACCESS(PID1K1L,7)
// PID1K1H<PID1K18>
extern volatile __bit                   PID1K18             __at(0x2C88);	// @ (0x591 * 8 + 0)
#define                                 PID1K18_bit         _BIT_ACCESS(PID1K1H,0)
// PID1K1H<PID1K19>
extern volatile __bit                   PID1K19             __at(0x2C89);	// @ (0x591 * 8 + 1)
#define                                 PID1K19_bit         _BIT_ACCESS(PID1K1H,1)
// PID1K2L<PID1K20>
extern volatile __bit                   PID1K20             __at(0x2C90);	// @ (0x592 * 8 + 0)
#define                                 PID1K20_bit         _BIT_ACCESS(PID1K2L,0)
// PID1K2L<PID1K21>
extern volatile __bit                   PID1K21             __at(0x2C91);	// @ (0x592 * 8 + 1)
#define                                 PID1K21_bit         _BIT_ACCESS(PID1K2L,1)
// PID1K2H<PID1K210>
extern volatile __bit                   PID1K210            __at(0x2C9A);	// @ (0x593 * 8 + 2)
#define                                 PID1K210_bit        _BIT_ACCESS(PID1K2H,2)
// PID1K2H<PID1K211>
extern volatile __bit                   PID1K211            __at(0x2C9B);	// @ (0x593 * 8 + 3)
#define                                 PID1K211_bit        _BIT_ACCESS(PID1K2H,3)
// PID1K2H<PID1K212>
extern volatile __bit                   PID1K212            __at(0x2C9C);	// @ (0x593 * 8 + 4)
#define                                 PID1K212_bit        _BIT_ACCESS(PID1K2H,4)
// PID1K2H<PID1K213>
extern volatile __bit                   PID1K213            __at(0x2C9D);	// @ (0x593 * 8 + 5)
#define                                 PID1K213_bit        _BIT_ACCESS(PID1K2H,5)
// PID1K2H<PID1K214>
extern volatile __bit                   PID1K214            __at(0x2C9E);	// @ (0x593 * 8 + 6)
#define                                 PID1K214_bit        _BIT_ACCESS(PID1K2H,6)
// PID1K2H<PID1K215>
extern volatile __bit                   PID1K215            __at(0x2C9F);	// @ (0x593 * 8 + 7)
#define                                 PID1K215_bit        _BIT_ACCESS(PID1K2H,7)
// PID1K2L<PID1K22>
extern volatile __bit                   PID1K22             __at(0x2C92);	// @ (0x592 * 8 + 2)
#define                                 PID1K22_bit         _BIT_ACCESS(PID1K2L,2)
// PID1K2L<PID1K23>
extern volatile __bit                   PID1K23             __at(0x2C93);	// @ (0x592 * 8 + 3)
#define                                 PID1K23_bit         _BIT_ACCESS(PID1K2L,3)
// PID1K2L<PID1K24>
extern volatile __bit                   PID1K24             __at(0x2C94);	// @ (0x592 * 8 + 4)
#define                                 PID1K24_bit         _BIT_ACCESS(PID1K2L,4)
// PID1K2L<PID1K25>
extern volatile __bit                   PID1K25             __at(0x2C95);	// @ (0x592 * 8 + 5)
#define                                 PID1K25_bit         _BIT_ACCESS(PID1K2L,5)
// PID1K2L<PID1K26>
extern volatile __bit                   PID1K26             __at(0x2C96);	// @ (0x592 * 8 + 6)
#define                                 PID1K26_bit         _BIT_ACCESS(PID1K2L,6)
// PID1K2L<PID1K27>
extern volatile __bit                   PID1K27             __at(0x2C97);	// @ (0x592 * 8 + 7)
#define                                 PID1K27_bit         _BIT_ACCESS(PID1K2L,7)
// PID1K2H<PID1K28>
extern volatile __bit                   PID1K28             __at(0x2C98);	// @ (0x593 * 8 + 0)
#define                                 PID1K28_bit         _BIT_ACCESS(PID1K2H,0)
// PID1K2H<PID1K29>
extern volatile __bit                   PID1K29             __at(0x2C99);	// @ (0x593 * 8 + 1)
#define                                 PID1K29_bit         _BIT_ACCESS(PID1K2H,1)
// PID1K3L<PID1K30>
extern volatile __bit                   PID1K30             __at(0x2CA0);	// @ (0x594 * 8 + 0)
#define                                 PID1K30_bit         _BIT_ACCESS(PID1K3L,0)
// PID1K3L<PID1K31>
extern volatile __bit                   PID1K31             __at(0x2CA1);	// @ (0x594 * 8 + 1)
#define                                 PID1K31_bit         _BIT_ACCESS(PID1K3L,1)
// PID1K3H<PID1K310>
extern volatile __bit                   PID1K310            __at(0x2CAA);	// @ (0x595 * 8 + 2)
#define                                 PID1K310_bit        _BIT_ACCESS(PID1K3H,2)
// PID1K3H<PID1K311>
extern volatile __bit                   PID1K311            __at(0x2CAB);	// @ (0x595 * 8 + 3)
#define                                 PID1K311_bit        _BIT_ACCESS(PID1K3H,3)
// PID1K3H<PID1K312>
extern volatile __bit                   PID1K312            __at(0x2CAC);	// @ (0x595 * 8 + 4)
#define                                 PID1K312_bit        _BIT_ACCESS(PID1K3H,4)
// PID1K3H<PID1K313>
extern volatile __bit                   PID1K313            __at(0x2CAD);	// @ (0x595 * 8 + 5)
#define                                 PID1K313_bit        _BIT_ACCESS(PID1K3H,5)
// PID1K3H<PID1K314>
extern volatile __bit                   PID1K314            __at(0x2CAE);	// @ (0x595 * 8 + 6)
#define                                 PID1K314_bit        _BIT_ACCESS(PID1K3H,6)
// PID1K3H<PID1K315>
extern volatile __bit                   PID1K315            __at(0x2CAF);	// @ (0x595 * 8 + 7)
#define                                 PID1K315_bit        _BIT_ACCESS(PID1K3H,7)
// PID1K3L<PID1K32>
extern volatile __bit                   PID1K32             __at(0x2CA2);	// @ (0x594 * 8 + 2)
#define                                 PID1K32_bit         _BIT_ACCESS(PID1K3L,2)
// PID1K3L<PID1K33>
extern volatile __bit                   PID1K33             __at(0x2CA3);	// @ (0x594 * 8 + 3)
#define                                 PID1K33_bit         _BIT_ACCESS(PID1K3L,3)
// PID1K3L<PID1K34>
extern volatile __bit                   PID1K34             __at(0x2CA4);	// @ (0x594 * 8 + 4)
#define                                 PID1K34_bit         _BIT_ACCESS(PID1K3L,4)
// PID1K3L<PID1K35>
extern volatile __bit                   PID1K35             __at(0x2CA5);	// @ (0x594 * 8 + 5)
#define                                 PID1K35_bit         _BIT_ACCESS(PID1K3L,5)
// PID1K3L<PID1K36>
extern volatile __bit                   PID1K36             __at(0x2CA6);	// @ (0x594 * 8 + 6)
#define                                 PID1K36_bit         _BIT_ACCESS(PID1K3L,6)
// PID1K3L<PID1K37>
extern volatile __bit                   PID1K37             __at(0x2CA7);	// @ (0x594 * 8 + 7)
#define                                 PID1K37_bit         _BIT_ACCESS(PID1K3L,7)
// PID1K3H<PID1K38>
extern volatile __bit                   PID1K38             __at(0x2CA8);	// @ (0x595 * 8 + 0)
#define                                 PID1K38_bit         _BIT_ACCESS(PID1K3H,0)
// PID1K3H<PID1K39>
extern volatile __bit                   PID1K39             __at(0x2CA9);	// @ (0x595 * 8 + 1)
#define                                 PID1K39_bit         _BIT_ACCESS(PID1K3H,1)
// PID1CON<PID1MODE0>
extern volatile __bit                   PID1MODE0           __at(0x30A0);	// @ (0x614 * 8 + 0)
#define                                 PID1MODE0_bit       _BIT_ACCESS(PID1CON,0)
// PID1CON<PID1MODE1>
extern volatile __bit                   PID1MODE1           __at(0x30A1);	// @ (0x614 * 8 + 1)
#define                                 PID1MODE1_bit       _BIT_ACCESS(PID1CON,1)
// PID1CON<PID1MODE2>
extern volatile __bit                   PID1MODE2           __at(0x30A2);	// @ (0x614 * 8 + 2)
#define                                 PID1MODE2_bit       _BIT_ACCESS(PID1CON,2)
// PID1OUTLL<PID1OUT0>
extern volatile __bit                   PID1OUT0            __at(0x2CB0);	// @ (0x596 * 8 + 0)
#define                                 PID1OUT0_bit        _BIT_ACCESS(PID1OUTLL,0)
// PID1OUTLL<PID1OUT1>
extern volatile __bit                   PID1OUT1            __at(0x2CB1);	// @ (0x596 * 8 + 1)
#define                                 PID1OUT1_bit        _BIT_ACCESS(PID1OUTLL,1)
// PID1OUTLH<PID1OUT10>
extern volatile __bit                   PID1OUT10           __at(0x2CBA);	// @ (0x597 * 8 + 2)
#define                                 PID1OUT10_bit       _BIT_ACCESS(PID1OUTLH,2)
// PID1OUTLH<PID1OUT11>
extern volatile __bit                   PID1OUT11           __at(0x2CBB);	// @ (0x597 * 8 + 3)
#define                                 PID1OUT11_bit       _BIT_ACCESS(PID1OUTLH,3)
// PID1OUTLH<PID1OUT12>
extern volatile __bit                   PID1OUT12           __at(0x2CBC);	// @ (0x597 * 8 + 4)
#define                                 PID1OUT12_bit       _BIT_ACCESS(PID1OUTLH,4)
// PID1OUTLH<PID1OUT13>
extern volatile __bit                   PID1OUT13           __at(0x2CBD);	// @ (0x597 * 8 + 5)
#define                                 PID1OUT13_bit       _BIT_ACCESS(PID1OUTLH,5)
// PID1OUTLH<PID1OUT14>
extern volatile __bit                   PID1OUT14           __at(0x2CBE);	// @ (0x597 * 8 + 6)
#define                                 PID1OUT14_bit       _BIT_ACCESS(PID1OUTLH,6)
// PID1OUTLH<PID1OUT15>
extern volatile __bit                   PID1OUT15           __at(0x2CBF);	// @ (0x597 * 8 + 7)
#define                                 PID1OUT15_bit       _BIT_ACCESS(PID1OUTLH,7)
// PID1OUTHL<PID1OUT16>
extern volatile __bit                   PID1OUT16           __at(0x2CC0);	// @ (0x598 * 8 + 0)
#define                                 PID1OUT16_bit       _BIT_ACCESS(PID1OUTHL,0)
// PID1OUTHL<PID1OUT17>
extern volatile __bit                   PID1OUT17           __at(0x2CC1);	// @ (0x598 * 8 + 1)
#define                                 PID1OUT17_bit       _BIT_ACCESS(PID1OUTHL,1)
// PID1OUTHL<PID1OUT18>
extern volatile __bit                   PID1OUT18           __at(0x2CC2);	// @ (0x598 * 8 + 2)
#define                                 PID1OUT18_bit       _BIT_ACCESS(PID1OUTHL,2)
// PID1OUTHL<PID1OUT19>
extern volatile __bit                   PID1OUT19           __at(0x2CC3);	// @ (0x598 * 8 + 3)
#define                                 PID1OUT19_bit       _BIT_ACCESS(PID1OUTHL,3)
// PID1OUTLL<PID1OUT2>
extern volatile __bit                   PID1OUT2            __at(0x2CB2);	// @ (0x596 * 8 + 2)
#define                                 PID1OUT2_bit        _BIT_ACCESS(PID1OUTLL,2)
// PID1OUTHL<PID1OUT20>
extern volatile __bit                   PID1OUT20           __at(0x2CC4);	// @ (0x598 * 8 + 4)
#define                                 PID1OUT20_bit       _BIT_ACCESS(PID1OUTHL,4)
// PID1OUTHL<PID1OUT21>
extern volatile __bit                   PID1OUT21           __at(0x2CC5);	// @ (0x598 * 8 + 5)
#define                                 PID1OUT21_bit       _BIT_ACCESS(PID1OUTHL,5)
// PID1OUTHL<PID1OUT22>
extern volatile __bit                   PID1OUT22           __at(0x2CC6);	// @ (0x598 * 8 + 6)
#define                                 PID1OUT22_bit       _BIT_ACCESS(PID1OUTHL,6)
// PID1OUTHL<PID1OUT23>
extern volatile __bit                   PID1OUT23           __at(0x2CC7);	// @ (0x598 * 8 + 7)
#define                                 PID1OUT23_bit       _BIT_ACCESS(PID1OUTHL,7)
// PID1OUTHH<PID1OUT24>
extern volatile __bit                   PID1OUT24           __at(0x2CC8);	// @ (0x599 * 8 + 0)
#define                                 PID1OUT24_bit       _BIT_ACCESS(PID1OUTHH,0)
// PID1OUTHH<PID1OUT25>
extern volatile __bit                   PID1OUT25           __at(0x2CC9);	// @ (0x599 * 8 + 1)
#define                                 PID1OUT25_bit       _BIT_ACCESS(PID1OUTHH,1)
// PID1OUTHH<PID1OUT26>
extern volatile __bit                   PID1OUT26           __at(0x2CCA);	// @ (0x599 * 8 + 2)
#define                                 PID1OUT26_bit       _BIT_ACCESS(PID1OUTHH,2)
// PID1OUTHH<PID1OUT27>
extern volatile __bit                   PID1OUT27           __at(0x2CCB);	// @ (0x599 * 8 + 3)
#define                                 PID1OUT27_bit       _BIT_ACCESS(PID1OUTHH,3)
// PID1OUTHH<PID1OUT28>
extern volatile __bit                   PID1OUT28           __at(0x2CCC);	// @ (0x599 * 8 + 4)
#define                                 PID1OUT28_bit       _BIT_ACCESS(PID1OUTHH,4)
// PID1OUTHH<PID1OUT29>
extern volatile __bit                   PID1OUT29           __at(0x2CCD);	// @ (0x599 * 8 + 5)
#define                                 PID1OUT29_bit       _BIT_ACCESS(PID1OUTHH,5)
// PID1OUTLL<PID1OUT3>
extern volatile __bit                   PID1OUT3            __at(0x2CB3);	// @ (0x596 * 8 + 3)
#define                                 PID1OUT3_bit        _BIT_ACCESS(PID1OUTLL,3)
// PID1OUTHH<PID1OUT30>
extern volatile __bit                   PID1OUT30           __at(0x2CCE);	// @ (0x599 * 8 + 6)
#define                                 PID1OUT30_bit       _BIT_ACCESS(PID1OUTHH,6)
// PID1OUTHH<PID1OUT31>
extern volatile __bit                   PID1OUT31           __at(0x2CCF);	// @ (0x599 * 8 + 7)
#define                                 PID1OUT31_bit       _BIT_ACCESS(PID1OUTHH,7)
// PID1OUTU<PID1OUT32>
extern volatile __bit                   PID1OUT32           __at(0x2CD0);	// @ (0x59A * 8 + 0)
#define                                 PID1OUT32_bit       _BIT_ACCESS(PID1OUTU,0)
// PID1OUTU<PID1OUT33>
extern volatile __bit                   PID1OUT33           __at(0x2CD1);	// @ (0x59A * 8 + 1)
#define                                 PID1OUT33_bit       _BIT_ACCESS(PID1OUTU,1)
// PID1OUTU<PID1OUT34>
extern volatile __bit                   PID1OUT34           __at(0x2CD2);	// @ (0x59A * 8 + 2)
#define                                 PID1OUT34_bit       _BIT_ACCESS(PID1OUTU,2)
// PID1OUTU<PID1OUT35>
extern volatile __bit                   PID1OUT35           __at(0x2CD3);	// @ (0x59A * 8 + 3)
#define                                 PID1OUT35_bit       _BIT_ACCESS(PID1OUTU,3)
// PID1OUTLL<PID1OUT4>
extern volatile __bit                   PID1OUT4            __at(0x2CB4);	// @ (0x596 * 8 + 4)
#define                                 PID1OUT4_bit        _BIT_ACCESS(PID1OUTLL,4)
// PID1OUTLL<PID1OUT5>
extern volatile __bit                   PID1OUT5            __at(0x2CB5);	// @ (0x596 * 8 + 5)
#define                                 PID1OUT5_bit        _BIT_ACCESS(PID1OUTLL,5)
// PID1OUTLL<PID1OUT6>
extern volatile __bit                   PID1OUT6            __at(0x2CB6);	// @ (0x596 * 8 + 6)
#define                                 PID1OUT6_bit        _BIT_ACCESS(PID1OUTLL,6)
// PID1OUTLL<PID1OUT7>
extern volatile __bit                   PID1OUT7            __at(0x2CB7);	// @ (0x596 * 8 + 7)
#define                                 PID1OUT7_bit        _BIT_ACCESS(PID1OUTLL,7)
// PID1OUTLH<PID1OUT8>
extern volatile __bit                   PID1OUT8            __at(0x2CB8);	// @ (0x597 * 8 + 0)
#define                                 PID1OUT8_bit        _BIT_ACCESS(PID1OUTLH,0)
// PID1OUTLH<PID1OUT9>
extern volatile __bit                   PID1OUT9            __at(0x2CB9);	// @ (0x597 * 8 + 1)
#define                                 PID1OUT9_bit        _BIT_ACCESS(PID1OUTLH,1)
// PID1SETL<PID1SET0>
extern volatile __bit                   PID1SET0            __at(0x2C60);	// @ (0x58C * 8 + 0)
#define                                 PID1SET0_bit        _BIT_ACCESS(PID1SETL,0)
// PID1SETL<PID1SET1>
extern volatile __bit                   PID1SET1            __at(0x2C61);	// @ (0x58C * 8 + 1)
#define                                 PID1SET1_bit        _BIT_ACCESS(PID1SETL,1)
// PID1SETH<PID1SET10>
extern volatile __bit                   PID1SET10           __at(0x2C6A);	// @ (0x58D * 8 + 2)
#define                                 PID1SET10_bit       _BIT_ACCESS(PID1SETH,2)
// PID1SETH<PID1SET11>
extern volatile __bit                   PID1SET11           __at(0x2C6B);	// @ (0x58D * 8 + 3)
#define                                 PID1SET11_bit       _BIT_ACCESS(PID1SETH,3)
// PID1SETH<PID1SET12>
extern volatile __bit                   PID1SET12           __at(0x2C6C);	// @ (0x58D * 8 + 4)
#define                                 PID1SET12_bit       _BIT_ACCESS(PID1SETH,4)
// PID1SETH<PID1SET13>
extern volatile __bit                   PID1SET13           __at(0x2C6D);	// @ (0x58D * 8 + 5)
#define                                 PID1SET13_bit       _BIT_ACCESS(PID1SETH,5)
// PID1SETH<PID1SET14>
extern volatile __bit                   PID1SET14           __at(0x2C6E);	// @ (0x58D * 8 + 6)
#define                                 PID1SET14_bit       _BIT_ACCESS(PID1SETH,6)
// PID1SETH<PID1SET15>
extern volatile __bit                   PID1SET15           __at(0x2C6F);	// @ (0x58D * 8 + 7)
#define                                 PID1SET15_bit       _BIT_ACCESS(PID1SETH,7)
// PID1SETL<PID1SET2>
extern volatile __bit                   PID1SET2            __at(0x2C62);	// @ (0x58C * 8 + 2)
#define                                 PID1SET2_bit        _BIT_ACCESS(PID1SETL,2)
// PID1SETL<PID1SET3>
extern volatile __bit                   PID1SET3            __at(0x2C63);	// @ (0x58C * 8 + 3)
#define                                 PID1SET3_bit        _BIT_ACCESS(PID1SETL,3)
// PID1SETL<PID1SET4>
extern volatile __bit                   PID1SET4            __at(0x2C64);	// @ (0x58C * 8 + 4)
#define                                 PID1SET4_bit        _BIT_ACCESS(PID1SETL,4)
// PID1SETL<PID1SET5>
extern volatile __bit                   PID1SET5            __at(0x2C65);	// @ (0x58C * 8 + 5)
#define                                 PID1SET5_bit        _BIT_ACCESS(PID1SETL,5)
// PID1SETL<PID1SET6>
extern volatile __bit                   PID1SET6            __at(0x2C66);	// @ (0x58C * 8 + 6)
#define                                 PID1SET6_bit        _BIT_ACCESS(PID1SETL,6)
// PID1SETL<PID1SET7>
extern volatile __bit                   PID1SET7            __at(0x2C67);	// @ (0x58C * 8 + 7)
#define                                 PID1SET7_bit        _BIT_ACCESS(PID1SETL,7)
// PID1SETH<PID1SET8>
extern volatile __bit                   PID1SET8            __at(0x2C68);	// @ (0x58D * 8 + 0)
#define                                 PID1SET8_bit        _BIT_ACCESS(PID1SETH,0)
// PID1SETH<PID1SET9>
extern volatile __bit                   PID1SET9            __at(0x2C69);	// @ (0x58D * 8 + 1)
#define                                 PID1SET9_bit        _BIT_ACCESS(PID1SETH,1)
// PID1Z1L<PID1Z10>
extern volatile __bit                   PID1Z10             __at(0x2CD8);	// @ (0x59B * 8 + 0)
#define                                 PID1Z10_bit         _BIT_ACCESS(PID1Z1L,0)
// PID1Z1L<PID1Z11>
extern volatile __bit                   PID1Z11             __at(0x2CD9);	// @ (0x59B * 8 + 1)
#define                                 PID1Z11_bit         _BIT_ACCESS(PID1Z1L,1)
// PID1Z1H<PID1Z110>
extern volatile __bit                   PID1Z110            __at(0x2CE2);	// @ (0x59C * 8 + 2)
#define                                 PID1Z110_bit        _BIT_ACCESS(PID1Z1H,2)
// PID1Z1H<PID1Z111>
extern volatile __bit                   PID1Z111            __at(0x2CE3);	// @ (0x59C * 8 + 3)
#define                                 PID1Z111_bit        _BIT_ACCESS(PID1Z1H,3)
// PID1Z1H<PID1Z112>
extern volatile __bit                   PID1Z112            __at(0x2CE4);	// @ (0x59C * 8 + 4)
#define                                 PID1Z112_bit        _BIT_ACCESS(PID1Z1H,4)
// PID1Z1H<PID1Z113>
extern volatile __bit                   PID1Z113            __at(0x2CE5);	// @ (0x59C * 8 + 5)
#define                                 PID1Z113_bit        _BIT_ACCESS(PID1Z1H,5)
// PID1Z1H<PID1Z114>
extern volatile __bit                   PID1Z114            __at(0x2CE6);	// @ (0x59C * 8 + 6)
#define                                 PID1Z114_bit        _BIT_ACCESS(PID1Z1H,6)
// PID1Z1H<PID1Z115>
extern volatile __bit                   PID1Z115            __at(0x2CE7);	// @ (0x59C * 8 + 7)
#define                                 PID1Z115_bit        _BIT_ACCESS(PID1Z1H,7)
// PID1Z1U<PID1Z116>
extern volatile __bit                   PID1Z116            __at(0x2CE8);	// @ (0x59D * 8 + 0)
#define                                 PID1Z116_bit        _BIT_ACCESS(PID1Z1U,0)
// PID1Z1L<PID1Z12>
extern volatile __bit                   PID1Z12             __at(0x2CDA);	// @ (0x59B * 8 + 2)
#define                                 PID1Z12_bit         _BIT_ACCESS(PID1Z1L,2)
// PID1Z1L<PID1Z13>
extern volatile __bit                   PID1Z13             __at(0x2CDB);	// @ (0x59B * 8 + 3)
#define                                 PID1Z13_bit         _BIT_ACCESS(PID1Z1L,3)
// PID1Z1L<PID1Z14>
extern volatile __bit                   PID1Z14             __at(0x2CDC);	// @ (0x59B * 8 + 4)
#define                                 PID1Z14_bit         _BIT_ACCESS(PID1Z1L,4)
// PID1Z1L<PID1Z15>
extern volatile __bit                   PID1Z15             __at(0x2CDD);	// @ (0x59B * 8 + 5)
#define                                 PID1Z15_bit         _BIT_ACCESS(PID1Z1L,5)
// PID1Z1L<PID1Z16>
extern volatile __bit                   PID1Z16             __at(0x2CDE);	// @ (0x59B * 8 + 6)
#define                                 PID1Z16_bit         _BIT_ACCESS(PID1Z1L,6)
// PID1Z1L<PID1Z17>
extern volatile __bit                   PID1Z17             __at(0x2CDF);	// @ (0x59B * 8 + 7)
