MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1618/mcu.h
#define                                 SCANLADR7_bit       _BIT_ACCESS(SCANLADRL,7)
// SCANLADRH<SCANLADR8>
extern volatile __bit                   SCANLADR8           __at(0x38C8);	// @ (0x719 * 8 + 0)
#define                                 SCANLADR8_bit       _BIT_ACCESS(SCANLADRH,0)
// SCANLADRH<SCANLADR9>
extern volatile __bit                   SCANLADR9           __at(0x38C9);	// @ (0x719 * 8 + 1)
#define                                 SCANLADR9_bit       _BIT_ACCESS(SCANLADRH,1)
// SCANCON0<SCANMODE0>
extern volatile __bit                   SCANMODE0           __at(0x38E0);	// @ (0x71C * 8 + 0)
#define                                 SCANMODE0_bit       _BIT_ACCESS(SCANCON0,0)
// SCANCON0<SCANMODE1>
extern volatile __bit                   SCANMODE1           __at(0x38E1);	// @ (0x71C * 8 + 1)
#define                                 SCANMODE1_bit       _BIT_ACCESS(SCANCON0,1)
// SCANTRIG<SCANTSEL0>
extern volatile __bit                   SCANTSEL0           __at(0x38E8);	// @ (0x71D * 8 + 0)
#define                                 SCANTSEL0_bit       _BIT_ACCESS(SCANTRIG,0)
// SCANTRIG<SCANTSEL1>
extern volatile __bit                   SCANTSEL1           __at(0x38E9);	// @ (0x71D * 8 + 1)
#define                                 SCANTSEL1_bit       _BIT_ACCESS(SCANTRIG,1)
// SCANTRIG<SCANTSEL2>
extern volatile __bit                   SCANTSEL2           __at(0x38EA);	// @ (0x71D * 8 + 2)
#define                                 SCANTSEL2_bit       _BIT_ACCESS(SCANTRIG,2)
// SCANTRIG<SCANTSEL3>
extern volatile __bit                   SCANTSEL3           __at(0x38EB);	// @ (0x71D * 8 + 3)
#define                                 SCANTSEL3_bit       _BIT_ACCESS(SCANTRIG,3)
// SSP1CON3<SCIE>
extern volatile __bit                   SCIE                __at(0x10BD);	// @ (0x217 * 8 + 5)
#define                                 SCIE_bit            _BIT_ACCESS(SSP1CON3,5)
// BAUD1CON<SCKP>
extern volatile __bit                   SCKP                __at(0xCFC);	// @ (0x19F * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUD1CON,4)
// OSCCON<SCS0>
extern volatile __bit                   SCS0                __at(0x4C8);	// @ (0x99 * 8 + 0)
#define                                 SCS0_bit            _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS1>
extern volatile __bit                   SCS1                __at(0x4C9);	// @ (0x99 * 8 + 1)
#define                                 SCS1_bit            _BIT_ACCESS(OSCCON,1)
// SSP1CON3<SDAHT>
extern volatile __bit                   SDAHT               __at(0x10BB);	// @ (0x217 * 8 + 3)
#define                                 SDAHT_bit           _BIT_ACCESS(SSP1CON3,3)
// TX1STA<SENDB>
extern volatile __bit                   SENDB               __at(0xCF3);	// @ (0x19E * 8 + 3)
#define                                 SENDB_bit           _BIT_ACCESS(TX1STA,3)
// PID1SETL<SET0>
extern volatile __bit                   SET0                __at(0x2C60);	// @ (0x58C * 8 + 0)
#define                                 SET0_bit            _BIT_ACCESS(PID1SETL,0)
// PID1SETL<SET1>
extern volatile __bit                   SET1                __at(0x2C61);	// @ (0x58C * 8 + 1)
#define                                 SET1_bit            _BIT_ACCESS(PID1SETL,1)
// PID1SETH<SET10>
extern volatile __bit                   SET10               __at(0x2C6A);	// @ (0x58D * 8 + 2)
#define                                 SET10_bit           _BIT_ACCESS(PID1SETH,2)
// PID1SETH<SET11>
extern volatile __bit                   SET11               __at(0x2C6B);	// @ (0x58D * 8 + 3)
#define                                 SET11_bit           _BIT_ACCESS(PID1SETH,3)
// PID1SETH<SET12>
extern volatile __bit                   SET12               __at(0x2C6C);	// @ (0x58D * 8 + 4)
#define                                 SET12_bit           _BIT_ACCESS(PID1SETH,4)
// PID1SETH<SET13>
extern volatile __bit                   SET13               __at(0x2C6D);	// @ (0x58D * 8 + 5)
#define                                 SET13_bit           _BIT_ACCESS(PID1SETH,5)
// PID1SETH<SET14>
extern volatile __bit                   SET14               __at(0x2C6E);	// @ (0x58D * 8 + 6)
#define                                 SET14_bit           _BIT_ACCESS(PID1SETH,6)
// PID1SETH<SET15>
extern volatile __bit                   SET15               __at(0x2C6F);	// @ (0x58D * 8 + 7)
#define                                 SET15_bit           _BIT_ACCESS(PID1SETH,7)
// PID1SETL<SET2>
extern volatile __bit                   SET2                __at(0x2C62);	// @ (0x58C * 8 + 2)
#define                                 SET2_bit            _BIT_ACCESS(PID1SETL,2)
// PID1SETL<SET3>
extern volatile __bit                   SET3                __at(0x2C63);	// @ (0x58C * 8 + 3)
#define                                 SET3_bit            _BIT_ACCESS(PID1SETL,3)
// PID1SETL<SET4>
extern volatile __bit                   SET4                __at(0x2C64);	// @ (0x58C * 8 + 4)
#define                                 SET4_bit            _BIT_ACCESS(PID1SETL,4)
// PID1SETL<SET5>
extern volatile __bit                   SET5                __at(0x2C65);	// @ (0x58C * 8 + 5)
#define                                 SET5_bit            _BIT_ACCESS(PID1SETL,5)
// PID1SETL<SET6>
extern volatile __bit                   SET6                __at(0x2C66);	// @ (0x58C * 8 + 6)
#define                                 SET6_bit            _BIT_ACCESS(PID1SETL,6)
// PID1SETL<SET7>
extern volatile __bit                   SET7                __at(0x2C67);	// @ (0x58C * 8 + 7)
#define                                 SET7_bit            _BIT_ACCESS(PID1SETL,7)
// PID1SETH<SET8>
extern volatile __bit                   SET8                __at(0x2C68);	// @ (0x58D * 8 + 0)
#define                                 SET8_bit            _BIT_ACCESS(PID1SETH,0)
// PID1SETH<SET9>
extern volatile __bit                   SET9                __at(0x2C69);	// @ (0x58D * 8 + 1)
#define                                 SET9_bit            _BIT_ACCESS(PID1SETH,1)
// CRCSHIFTL<SHIFT0>
extern volatile __bit                   SHIFT0              __at(0x3CA8);	// @ (0x795 * 8 + 0)
#define                                 SHIFT0_bit          _BIT_ACCESS(CRCSHIFTL,0)
// CRCSHIFTL<SHIFT1>
extern volatile __bit                   SHIFT1              __at(0x3CA9);	// @ (0x795 * 8 + 1)
#define                                 SHIFT1_bit          _BIT_ACCESS(CRCSHIFTL,1)
// CRCSHIFTH<SHIFT10>
extern volatile __bit                   SHIFT10             __at(0x3CB2);	// @ (0x796 * 8 + 2)
#define                                 SHIFT10_bit         _BIT_ACCESS(CRCSHIFTH,2)
// CRCSHIFTH<SHIFT11>
extern volatile __bit                   SHIFT11             __at(0x3CB3);	// @ (0x796 * 8 + 3)
#define                                 SHIFT11_bit         _BIT_ACCESS(CRCSHIFTH,3)
// CRCSHIFTH<SHIFT12>
extern volatile __bit                   SHIFT12             __at(0x3CB4);	// @ (0x796 * 8 + 4)
#define                                 SHIFT12_bit         _BIT_ACCESS(CRCSHIFTH,4)
// CRCSHIFTH<SHIFT13>
extern volatile __bit                   SHIFT13             __at(0x3CB5);	// @ (0x796 * 8 + 5)
#define                                 SHIFT13_bit         _BIT_ACCESS(CRCSHIFTH,5)
// CRCSHIFTH<SHIFT14>
extern volatile __bit                   SHIFT14             __at(0x3CB6);	// @ (0x796 * 8 + 6)
#define                                 SHIFT14_bit         _BIT_ACCESS(CRCSHIFTH,6)
// CRCSHIFTH<SHIFT15>
extern volatile __bit                   SHIFT15             __at(0x3CB7);	// @ (0x796 * 8 + 7)
#define                                 SHIFT15_bit         _BIT_ACCESS(CRCSHIFTH,7)
// CRCSHIFTL<SHIFT2>
extern volatile __bit                   SHIFT2              __at(0x3CAA);	// @ (0x795 * 8 + 2)
#define                                 SHIFT2_bit          _BIT_ACCESS(CRCSHIFTL,2)
// CRCSHIFTL<SHIFT3>
extern volatile __bit                   SHIFT3              __at(0x3CAB);	// @ (0x795 * 8 + 3)
#define                                 SHIFT3_bit          _BIT_ACCESS(CRCSHIFTL,3)
// CRCSHIFTL<SHIFT4>
extern volatile __bit                   SHIFT4              __at(0x3CAC);	// @ (0x795 * 8 + 4)
#define                                 SHIFT4_bit          _BIT_ACCESS(CRCSHIFTL,4)
// CRCSHIFTL<SHIFT5>
extern volatile __bit                   SHIFT5              __at(0x3CAD);	// @ (0x795 * 8 + 5)
#define                                 SHIFT5_bit          _BIT_ACCESS(CRCSHIFTL,5)
// CRCSHIFTL<SHIFT6>
extern volatile __bit                   SHIFT6              __at(0x3CAE);	// @ (0x795 * 8 + 6)
#define                                 SHIFT6_bit          _BIT_ACCESS(CRCSHIFTL,6)
// CRCSHIFTL<SHIFT7>
extern volatile __bit                   SHIFT7              __at(0x3CAF);	// @ (0x795 * 8 + 7)
#define                                 SHIFT7_bit          _BIT_ACCESS(CRCSHIFTL,7)
// CRCSHIFTH<SHIFT8>
extern volatile __bit                   SHIFT8              __at(0x3CB0);	// @ (0x796 * 8 + 0)
#define                                 SHIFT8_bit          _BIT_ACCESS(CRCSHIFTH,0)
// CRCSHIFTH<SHIFT9>
extern volatile __bit                   SHIFT9              __at(0x3CB1);	// @ (0x796 * 8 + 1)
#define                                 SHIFT9_bit          _BIT_ACCESS(CRCSHIFTH,1)
// CRCCON0<SHIFTM>
extern volatile __bit                   SHIFTM              __at(0x3CC9);	// @ (0x799 * 8 + 1)
#define                                 SHIFTM_bit          _BIT_ACCESS(CRCCON0,1)
// CWG1AS0<SHUTDOWN>
extern volatile __bit                   SHUTDOWN            __at(0x349F);	// @ (0x693 * 8 + 7)
#define                                 SHUTDOWN_bit        _BIT_ACCESS(CWG1AS0,7)
// SLRCONA<SLRA0>
extern volatile __bit                   SLRA0               __at(0x1860);	// @ (0x30C * 8 + 0)
#define                                 SLRA0_bit           _BIT_ACCESS(SLRCONA,0)
// SLRCONA<SLRA1>
extern volatile __bit                   SLRA1               __at(0x1861);	// @ (0x30C * 8 + 1)
#define                                 SLRA1_bit           _BIT_ACCESS(SLRCONA,1)
// SLRCONA<SLRA2>
extern volatile __bit                   SLRA2               __at(0x1862);	// @ (0x30C * 8 + 2)
#define                                 SLRA2_bit           _BIT_ACCESS(SLRCONA,2)
// SLRCONA<SLRA4>
extern volatile __bit                   SLRA4               __at(0x1864);	// @ (0x30C * 8 + 4)
#define                                 SLRA4_bit           _BIT_ACCESS(SLRCONA,4)
// SLRCONA<SLRA5>
extern volatile __bit                   SLRA5               __at(0x1865);	// @ (0x30C * 8 + 5)
#define                                 SLRA5_bit           _BIT_ACCESS(SLRCONA,5)
// SLRCONB<SLRB4>
extern volatile __bit                   SLRB4               __at(0x186C);	// @ (0x30D * 8 + 4)
#define                                 SLRB4_bit           _BIT_ACCESS(SLRCONB,4)
// SLRCONB<SLRB5>
extern volatile __bit                   SLRB5               __at(0x186D);	// @ (0x30D * 8 + 5)
#define                                 SLRB5_bit           _BIT_ACCESS(SLRCONB,5)
// SLRCONB<SLRB6>
extern volatile __bit                   SLRB6               __at(0x186E);	// @ (0x30D * 8 + 6)
#define                                 SLRB6_bit           _BIT_ACCESS(SLRCONB,6)
// SLRCONB<SLRB7>
extern volatile __bit                   SLRB7               __at(0x186F);	// @ (0x30D * 8 + 7)
#define                                 SLRB7_bit           _BIT_ACCESS(SLRCONB,7)
// SLRCONC<SLRC0>
extern volatile __bit                   SLRC0               __at(0x1870);	// @ (0x30E * 8 + 0)
#define                                 SLRC0_bit           _BIT_ACCESS(SLRCONC,0)
// SLRCONC<SLRC1>
extern volatile __bit                   SLRC1               __at(0x1871);	// @ (0x30E * 8 + 1)
#define                                 SLRC1_bit           _BIT_ACCESS(SLRCONC,1)
// SLRCONC<SLRC2>
extern volatile __bit                   SLRC2               __at(0x1872);	// @ (0x30E * 8 + 2)
#define                                 SLRC2_bit           _BIT_ACCESS(SLRCONC,2)
// SLRCONC<SLRC3>
extern volatile __bit                   SLRC3               __at(0x1873);	// @ (0x30E * 8 + 3)
#define                                 SLRC3_bit           _BIT_ACCESS(SLRCONC,3)
// SLRCONC<SLRC4>
extern volatile __bit                   SLRC4               __at(0x1874);	// @ (0x30E * 8 + 4)
#define                                 SLRC4_bit           _BIT_ACCESS(SLRCONC,4)
// SLRCONC<SLRC5>
extern volatile __bit                   SLRC5               __at(0x1875);	// @ (0x30E * 8 + 5)
#define                                 SLRC5_bit           _BIT_ACCESS(SLRCONC,5)
// SLRCONC<SLRC6>
extern volatile __bit                   SLRC6               __at(0x1876);	// @ (0x30E * 8 + 6)
#define                                 SLRC6_bit           _BIT_ACCESS(SLRCONC,6)
// SLRCONC<SLRC7>
extern volatile __bit                   SLRC7               __at(0x1877);	// @ (0x30E * 8 + 7)
#define                                 SLRC7_bit           _BIT_ACCESS(SLRCONC,7)
// SSP1STAT<SMP>
extern volatile __bit                   SMP                 __at(0x10A7);	// @ (0x214 * 8 + 7)
#define                                 SMP_bit             _BIT_ACCESS(SSP1STAT,7)
// SMT1STAT<SMT1AS>
extern volatile __bit                   SMT1AS              __at(0x6CD0);	// @ (0xD9A * 8 + 0)
#define                                 SMT1AS_bit          _BIT_ACCESS(SMT1STAT,0)
// SMT1CPRL<SMT1CPR0>
extern volatile __bit                   SMT1CPR0            __at(0x6C78);	// @ (0xD8F * 8 + 0)
#define                                 SMT1CPR0_bit        _BIT_ACCESS(SMT1CPRL,0)
// SMT1CPRL<SMT1CPR1>
extern volatile __bit                   SMT1CPR1            __at(0x6C79);	// @ (0xD8F * 8 + 1)
#define                                 SMT1CPR1_bit        _BIT_ACCESS(SMT1CPRL,1)
// SMT1CPRH<SMT1CPR10>
extern volatile __bit                   SMT1CPR10           __at(0x6C82);	// @ (0xD90 * 8 + 2)
#define                                 SMT1CPR10_bit       _BIT_ACCESS(SMT1CPRH,2)
// SMT1CPRH<SMT1CPR11>
extern volatile __bit                   SMT1CPR11           __at(0x6C83);	// @ (0xD90 * 8 + 3)
#define                                 SMT1CPR11_bit       _BIT_ACCESS(SMT1CPRH,3)
// SMT1CPRH<SMT1CPR12>
extern volatile __bit                   SMT1CPR12           __at(0x6C84);	// @ (0xD90 * 8 + 4)
#define                                 SMT1CPR12_bit       _BIT_ACCESS(SMT1CPRH,4)
// SMT1CPRH<SMT1CPR13>
extern volatile __bit                   SMT1CPR13           __at(0x6C85);	// @ (0xD90 * 8 + 5)
#define                                 SMT1CPR13_bit       _BIT_ACCESS(SMT1CPRH,5)
// SMT1CPRH<SMT1CPR14>
extern volatile __bit                   SMT1CPR14           __at(0x6C86);	// @ (0xD90 * 8 + 6)
#define                                 SMT1CPR14_bit       _BIT_ACCESS(SMT1CPRH,6)
// SMT1CPRH<SMT1CPR15>
extern volatile __bit                   SMT1CPR15           __at(0x6C87);	// @ (0xD90 * 8 + 7)
#define                                 SMT1CPR15_bit       _BIT_ACCESS(SMT1CPRH,7)
// SMT1CPRU<SMT1CPR16>
extern volatile __bit                   SMT1CPR16           __at(0x6C88);	// @ (0xD91 * 8 + 0)
#define                                 SMT1CPR16_bit       _BIT_ACCESS(SMT1CPRU,0)
// SMT1CPRU<SMT1CPR17>
extern volatile __bit                   SMT1CPR17           __at(0x6C89);	// @ (0xD91 * 8 + 1)
#define                                 SMT1CPR17_bit       _BIT_ACCESS(SMT1CPRU,1)
// SMT1CPRU<SMT1CPR18>
extern volatile __bit                   SMT1CPR18           __at(0x6C8A);	// @ (0xD91 * 8 + 2)
#define                                 SMT1CPR18_bit       _BIT_ACCESS(SMT1CPRU,2)
// SMT1CPRU<SMT1CPR19>
extern volatile __bit                   SMT1CPR19           __at(0x6C8B);	// @ (0xD91 * 8 + 3)
#define                                 SMT1CPR19_bit       _BIT_ACCESS(SMT1CPRU,3)
// SMT1CPRL<SMT1CPR2>
extern volatile __bit                   SMT1CPR2            __at(0x6C7A);	// @ (0xD8F * 8 + 2)
#define                                 SMT1CPR2_bit        _BIT_ACCESS(SMT1CPRL,2)
// SMT1CPRU<SMT1CPR20>
extern volatile __bit                   SMT1CPR20           __at(0x6C8C);	// @ (0xD91 * 8 + 4)
#define                                 SMT1CPR20_bit       _BIT_ACCESS(SMT1CPRU,4)
// SMT1CPRU<SMT1CPR21>
extern volatile __bit                   SMT1CPR21           __at(0x6C8D);	// @ (0xD91 * 8 + 5)
#define                                 SMT1CPR21_bit       _BIT_ACCESS(SMT1CPRU,5)
// SMT1CPRU<SMT1CPR22>
extern volatile __bit                   SMT1CPR22           __at(0x6C8E);	// @ (0xD91 * 8 + 6)
#define                                 SMT1CPR22_bit       _BIT_ACCESS(SMT1CPRU,6)
// SMT1CPRU<SMT1CPR23>
extern volatile __bit                   SMT1CPR23           __at(0x6C8F);	// @ (0xD91 * 8 + 7)
#define                                 SMT1CPR23_bit       _BIT_ACCESS(SMT1CPRU,7)
// SMT1CPRL<SMT1CPR3>
extern volatile __bit                   SMT1CPR3            __at(0x6C7B);	// @ (0xD8F * 8 + 3)
#define                                 SMT1CPR3_bit        _BIT_ACCESS(SMT1CPRL,3)
// SMT1CPRL<SMT1CPR4>
extern volatile __bit                   SMT1CPR4            __at(0x6C7C);	// @ (0xD8F * 8 + 4)
#define                                 SMT1CPR4_bit        _BIT_ACCESS(SMT1CPRL,4)
// SMT1CPRL<SMT1CPR5>
extern volatile __bit                   SMT1CPR5            __at(0x6C7D);	// @ (0xD8F * 8 + 5)
#define                                 SMT1CPR5_bit        _BIT_ACCESS(SMT1CPRL,5)
// SMT1CPRL<SMT1CPR6>
extern volatile __bit                   SMT1CPR6            __at(0x6C7E);	// @ (0xD8F * 8 + 6)
#define                                 SMT1CPR6_bit        _BIT_ACCESS(SMT1CPRL,6)
// SMT1CPRL<SMT1CPR7>
extern volatile __bit                   SMT1CPR7            __at(0x6C7F);	// @ (0xD8F * 8 + 7)
#define                                 SMT1CPR7_bit        _BIT_ACCESS(SMT1CPRL,7)
// SMT1CPRH<SMT1CPR8>
extern volatile __bit                   SMT1CPR8            __at(0x6C80);	// @ (0xD90 * 8 + 0)
#define                                 SMT1CPR8_bit        _BIT_ACCESS(SMT1CPRH,0)
// SMT1CPRH<SMT1CPR9>
extern volatile __bit                   SMT1CPR9            __at(0x6C81);	// @ (0xD90 * 8 + 1)
#define                                 SMT1CPR9_bit        _BIT_ACCESS(SMT1CPRH,1)
// SMT1STAT<SMT1CPRUP>
extern volatile __bit                   SMT1CPRUP           __at(0x6CD7);	// @ (0xD9A * 8 + 7)
#define                                 SMT1CPRUP_bit       _BIT_ACCESS(SMT1STAT,7)
// SMT1CPWL<SMT1CPW0>
extern volatile __bit                   SMT1CPW0            __at(0x6C90);	// @ (0xD92 * 8 + 0)
#define                                 SMT1CPW0_bit        _BIT_ACCESS(SMT1CPWL,0)
// SMT1CPWL<SMT1CPW1>
extern volatile __bit                   SMT1CPW1            __at(0x6C91);	// @ (0xD92 * 8 + 1)
#define                                 SMT1CPW1_bit        _BIT_ACCESS(SMT1CPWL,1)
// SMT1CPWH<SMT1CPW10>
extern volatile __bit                   SMT1CPW10           __at(0x6C9A);	// @ (0xD93 * 8 + 2)
#define                                 SMT1CPW10_bit       _BIT_ACCESS(SMT1CPWH,2)
// SMT1CPWH<SMT1CPW11>
extern volatile __bit                   SMT1CPW11           __at(0x6C9B);	// @ (0xD93 * 8 + 3)
#define                                 SMT1CPW11_bit       _BIT_ACCESS(SMT1CPWH,3)
// SMT1CPWH<SMT1CPW12>
extern volatile __bit                   SMT1CPW12           __at(0x6C9C);	// @ (0xD93 * 8 + 4)
#define                                 SMT1CPW12_bit       _BIT_ACCESS(SMT1CPWH,4)
// SMT1CPWH<SMT1CPW13>
extern volatile __bit                   SMT1CPW13           __at(0x6C9D);	// @ (0xD93 * 8 + 5)
#define                                 SMT1CPW13_bit       _BIT_ACCESS(SMT1CPWH,5)
// SMT1CPWH<SMT1CPW14>
extern volatile __bit                   SMT1CPW14           __at(0x6C9E);	// @ (0xD93 * 8 + 6)
#define                                 SMT1CPW14_bit       _BIT_ACCESS(SMT1CPWH,6)
// SMT1CPWH<SMT1CPW15>
extern volatile __bit                   SMT1CPW15           __at(0x6C9F);	// @ (0xD93 * 8 + 7)
#define                                 SMT1CPW15_bit       _BIT_ACCESS(SMT1CPWH,7)
// SMT1CPWU<SMT1CPW16>
extern volatile __bit                   SMT1CPW16           __at(0x6CA0);	// @ (0xD94 * 8 + 0)
#define                                 SMT1CPW16_bit       _BIT_ACCESS(SMT1CPWU,0)
// SMT1CPWU<SMT1CPW17>
extern volatile __bit                   SMT1CPW17           __at(0x6CA1);	// @ (0xD94 * 8 + 1)
#define                                 SMT1CPW17_bit       _BIT_ACCESS(SMT1CPWU,1)
// SMT1CPWU<SMT1CPW18>
extern volatile __bit                   SMT1CPW18           __at(0x6CA2);	// @ (0xD94 * 8 + 2)
#define                                 SMT1CPW18_bit       _BIT_ACCESS(SMT1CPWU,2)
// SMT1CPWU<SMT1CPW19>
extern volatile __bit                   SMT1CPW19           __at(0x6CA3);	// @ (0xD94 * 8 + 3)
#define                                 SMT1CPW19_bit       _BIT_ACCESS(SMT1CPWU,3)
// SMT1CPWL<SMT1CPW2>
extern volatile __bit                   SMT1CPW2            __at(0x6C92);	// @ (0xD92 * 8 + 2)
#define                                 SMT1CPW2_bit        _BIT_ACCESS(SMT1CPWL,2)
// SMT1CPWU<SMT1CPW20>
extern volatile __bit                   SMT1CPW20           __at(0x6CA4);	// @ (0xD94 * 8 + 4)
#define                                 SMT1CPW20_bit       _BIT_ACCESS(SMT1CPWU,4)
// SMT1CPWU<SMT1CPW21>
extern volatile __bit                   SMT1CPW21           __at(0x6CA5);	// @ (0xD94 * 8 + 5)
#define                                 SMT1CPW21_bit       _BIT_ACCESS(SMT1CPWU,5)
// SMT1CPWU<SMT1CPW22>
extern volatile __bit                   SMT1CPW22           __at(0x6CA6);	// @ (0xD94 * 8 + 6)
#define                                 SMT1CPW22_bit       _BIT_ACCESS(SMT1CPWU,6)
// SMT1CPWU<SMT1CPW23>
extern volatile __bit                   SMT1CPW23           __at(0x6CA7);	// @ (0xD94 * 8 + 7)
#define                                 SMT1CPW23_bit       _BIT_ACCESS(SMT1CPWU,7)
// SMT1CPWL<SMT1CPW3>
extern volatile __bit                   SMT1CPW3            __at(0x6C93);	// @ (0xD92 * 8 + 3)
#define                                 SMT1CPW3_bit        _BIT_ACCESS(SMT1CPWL,3)
// SMT1CPWL<SMT1CPW4>
extern volatile __bit                   SMT1CPW4            __at(0x6C94);	// @ (0xD92 * 8 + 4)
#define                                 SMT1CPW4_bit        _BIT_ACCESS(SMT1CPWL,4)
// SMT1CPWL<SMT1CPW5>
extern volatile __bit                   SMT1CPW5            __at(0x6C95);	// @ (0xD92 * 8 + 5)
#define                                 SMT1CPW5_bit        _BIT_ACCESS(SMT1CPWL,5)
// SMT1CPWL<SMT1CPW6>
extern volatile __bit                   SMT1CPW6            __at(0x6C96);	// @ (0xD92 * 8 + 6)
#define                                 SMT1CPW6_bit        _BIT_ACCESS(SMT1CPWL,6)
// SMT1CPWL<SMT1CPW7>
extern volatile __bit                   SMT1CPW7            __at(0x6C97);	// @ (0xD92 * 8 + 7)
#define                                 SMT1CPW7_bit        _BIT_ACCESS(SMT1CPWL,7)
// SMT1CPWH<SMT1CPW8>
extern volatile __bit                   SMT1CPW8            __at(0x6C98);	// @ (0xD93 * 8 + 0)
#define                                 SMT1CPW8_bit        _BIT_ACCESS(SMT1CPWH,0)
// SMT1CPWH<SMT1CPW9>
extern volatile __bit                   SMT1CPW9            __at(0x6C99);	// @ (0xD93 * 8 + 1)
#define                                 SMT1CPW9_bit        _BIT_ACCESS(SMT1CPWH,1)
// SMT1STAT<SMT1CPWUP>
extern volatile __bit                   SMT1CPWUP           __at(0x6CD6);	// @ (0xD9A * 8 + 6)
#define                                 SMT1CPWUP_bit       _BIT_ACCESS(SMT1STAT,6)
// SMT1CLK<SMT1CSEL0>
extern volatile __bit                   SMT1CSEL0           __at(0x6CD8);	// @ (0xD9B * 8 + 0)
#define                                 SMT1CSEL0_bit       _BIT_ACCESS(SMT1CLK,0)
// SMT1CLK<SMT1CSEL1>
extern volatile __bit                   SMT1CSEL1           __at(0x6CD9);	// @ (0xD9B * 8 + 1)
#define                                 SMT1CSEL1_bit       _BIT_ACCESS(SMT1CLK,1)
// SMT1CLK<SMT1CSEL2>
extern volatile __bit                   SMT1CSEL2           __at(0x6CDA);	// @ (0xD9B * 8 + 2)
