MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1618/mcu.h
#define                                 SSP1BUF3_bit        _BIT_ACCESS(SSP1BUF,3)
// SSP1BUF<SSP1BUF4>
extern volatile __bit                   SSP1BUF4            __at(0x108C);	// @ (0x211 * 8 + 4)
#define                                 SSP1BUF4_bit        _BIT_ACCESS(SSP1BUF,4)
// SSP1BUF<SSP1BUF5>
extern volatile __bit                   SSP1BUF5            __at(0x108D);	// @ (0x211 * 8 + 5)
#define                                 SSP1BUF5_bit        _BIT_ACCESS(SSP1BUF,5)
// SSP1BUF<SSP1BUF6>
extern volatile __bit                   SSP1BUF6            __at(0x108E);	// @ (0x211 * 8 + 6)
#define                                 SSP1BUF6_bit        _BIT_ACCESS(SSP1BUF,6)
// SSP1BUF<SSP1BUF7>
extern volatile __bit                   SSP1BUF7            __at(0x108F);	// @ (0x211 * 8 + 7)
#define                                 SSP1BUF7_bit        _BIT_ACCESS(SSP1BUF,7)
// PIE1<SSP1IE>
extern volatile __bit                   SSP1IE              __at(0x483);	// @ (0x90 * 8 + 3)
#define                                 SSP1IE_bit          _BIT_ACCESS(PIE1,3)
// PIR1<SSP1IF>
extern volatile __bit                   SSP1IF              __at(0x83);	// @ (0x10 * 8 + 3)
#define                                 SSP1IF_bit          _BIT_ACCESS(PIR1,3)
// SSP1MSK<SSP1MSK0>
extern volatile __bit                   SSP1MSK0            __at(0x1098);	// @ (0x213 * 8 + 0)
#define                                 SSP1MSK0_bit        _BIT_ACCESS(SSP1MSK,0)
// SSP1MSK<SSP1MSK1>
extern volatile __bit                   SSP1MSK1            __at(0x1099);	// @ (0x213 * 8 + 1)
#define                                 SSP1MSK1_bit        _BIT_ACCESS(SSP1MSK,1)
// SSP1MSK<SSP1MSK2>
extern volatile __bit                   SSP1MSK2            __at(0x109A);	// @ (0x213 * 8 + 2)
#define                                 SSP1MSK2_bit        _BIT_ACCESS(SSP1MSK,2)
// SSP1MSK<SSP1MSK3>
extern volatile __bit                   SSP1MSK3            __at(0x109B);	// @ (0x213 * 8 + 3)
#define                                 SSP1MSK3_bit        _BIT_ACCESS(SSP1MSK,3)
// SSP1MSK<SSP1MSK4>
extern volatile __bit                   SSP1MSK4            __at(0x109C);	// @ (0x213 * 8 + 4)
#define                                 SSP1MSK4_bit        _BIT_ACCESS(SSP1MSK,4)
// SSP1MSK<SSP1MSK5>
extern volatile __bit                   SSP1MSK5            __at(0x109D);	// @ (0x213 * 8 + 5)
#define                                 SSP1MSK5_bit        _BIT_ACCESS(SSP1MSK,5)
// SSP1MSK<SSP1MSK6>
extern volatile __bit                   SSP1MSK6            __at(0x109E);	// @ (0x213 * 8 + 6)
#define                                 SSP1MSK6_bit        _BIT_ACCESS(SSP1MSK,6)
// SSP1MSK<SSP1MSK7>
extern volatile __bit                   SSP1MSK7            __at(0x109F);	// @ (0x213 * 8 + 7)
#define                                 SSP1MSK7_bit        _BIT_ACCESS(SSP1MSK,7)
// SSPCLKPPS<SSPCLKPPS0>
extern volatile __bit                   SSPCLKPPS0          __at(0x7100);	// @ (0xE20 * 8 + 0)
#define                                 SSPCLKPPS0_bit      _BIT_ACCESS(SSPCLKPPS,0)
// SSPCLKPPS<SSPCLKPPS1>
extern volatile __bit                   SSPCLKPPS1          __at(0x7101);	// @ (0xE20 * 8 + 1)
#define                                 SSPCLKPPS1_bit      _BIT_ACCESS(SSPCLKPPS,1)
// SSPCLKPPS<SSPCLKPPS2>
extern volatile __bit                   SSPCLKPPS2          __at(0x7102);	// @ (0xE20 * 8 + 2)
#define                                 SSPCLKPPS2_bit      _BIT_ACCESS(SSPCLKPPS,2)
// SSPCLKPPS<SSPCLKPPS3>
extern volatile __bit                   SSPCLKPPS3          __at(0x7103);	// @ (0xE20 * 8 + 3)
#define                                 SSPCLKPPS3_bit      _BIT_ACCESS(SSPCLKPPS,3)
// SSPCLKPPS<SSPCLKPPS4>
extern volatile __bit                   SSPCLKPPS4          __at(0x7104);	// @ (0xE20 * 8 + 4)
#define                                 SSPCLKPPS4_bit      _BIT_ACCESS(SSPCLKPPS,4)
// SSPDATPPS<SSPDATPPS0>
extern volatile __bit                   SSPDATPPS0          __at(0x7108);	// @ (0xE21 * 8 + 0)
#define                                 SSPDATPPS0_bit      _BIT_ACCESS(SSPDATPPS,0)
// SSPDATPPS<SSPDATPPS1>
extern volatile __bit                   SSPDATPPS1          __at(0x7109);	// @ (0xE21 * 8 + 1)
#define                                 SSPDATPPS1_bit      _BIT_ACCESS(SSPDATPPS,1)
// SSPDATPPS<SSPDATPPS2>
extern volatile __bit                   SSPDATPPS2          __at(0x710A);	// @ (0xE21 * 8 + 2)
#define                                 SSPDATPPS2_bit      _BIT_ACCESS(SSPDATPPS,2)
// SSPDATPPS<SSPDATPPS3>
extern volatile __bit                   SSPDATPPS3          __at(0x710B);	// @ (0xE21 * 8 + 3)
#define                                 SSPDATPPS3_bit      _BIT_ACCESS(SSPDATPPS,3)
// SSPDATPPS<SSPDATPPS4>
extern volatile __bit                   SSPDATPPS4          __at(0x710C);	// @ (0xE21 * 8 + 4)
#define                                 SSPDATPPS4_bit      _BIT_ACCESS(SSPDATPPS,4)
// SSP1CON1<SSPEN>
extern volatile __bit                   SSPEN               __at(0x10AD);	// @ (0x215 * 8 + 5)
#define                                 SSPEN_bit           _BIT_ACCESS(SSP1CON1,5)
// SSP1CON1<SSPM0>
extern volatile __bit                   SSPM0               __at(0x10A8);	// @ (0x215 * 8 + 0)
#define                                 SSPM0_bit           _BIT_ACCESS(SSP1CON1,0)
// SSP1CON1<SSPM1>
extern volatile __bit                   SSPM1               __at(0x10A9);	// @ (0x215 * 8 + 1)
#define                                 SSPM1_bit           _BIT_ACCESS(SSP1CON1,1)
// SSP1CON1<SSPM2>
extern volatile __bit                   SSPM2               __at(0x10AA);	// @ (0x215 * 8 + 2)
#define                                 SSPM2_bit           _BIT_ACCESS(SSP1CON1,2)
// SSP1CON1<SSPM3>
extern volatile __bit                   SSPM3               __at(0x10AB);	// @ (0x215 * 8 + 3)
#define                                 SSPM3_bit           _BIT_ACCESS(SSP1CON1,3)
// SSP1CON1<SSPOV>
extern volatile __bit                   SSPOV               __at(0x10AE);	// @ (0x215 * 8 + 6)
#define                                 SSPOV_bit           _BIT_ACCESS(SSP1CON1,6)
// SSPSSPPS<SSPSSPPS0>
extern volatile __bit                   SSPSSPPS0           __at(0x7110);	// @ (0xE22 * 8 + 0)
#define                                 SSPSSPPS0_bit       _BIT_ACCESS(SSPSSPPS,0)
// SSPSSPPS<SSPSSPPS1>
extern volatile __bit                   SSPSSPPS1           __at(0x7111);	// @ (0xE22 * 8 + 1)
#define                                 SSPSSPPS1_bit       _BIT_ACCESS(SSPSSPPS,1)
// SSPSSPPS<SSPSSPPS2>
extern volatile __bit                   SSPSSPPS2           __at(0x7112);	// @ (0xE22 * 8 + 2)
#define                                 SSPSSPPS2_bit       _BIT_ACCESS(SSPSSPPS,2)
// SSPSSPPS<SSPSSPPS3>
extern volatile __bit                   SSPSSPPS3           __at(0x7113);	// @ (0xE22 * 8 + 3)
#define                                 SSPSSPPS3_bit       _BIT_ACCESS(SSPSSPPS,3)
// SSPSSPPS<SSPSSPPS4>
extern volatile __bit                   SSPSSPPS4           __at(0x7114);	// @ (0xE22 * 8 + 4)
#define                                 SSPSSPPS4_bit       _BIT_ACCESS(SSPSSPPS,4)
// WDTTMR<STATE>
extern volatile __bit                   STATE               __at(0x38AA);	// @ (0x715 * 8 + 2)
#define                                 STATE_bit           _BIT_ACCESS(WDTTMR,2)
// PCON<STKOVF>
extern volatile __bit                   STKOVF              __at(0x4B7);	// @ (0x96 * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(PCON,7)
// PCON<STKUNF>
extern volatile __bit                   STKUNF              __at(0x4B6);	// @ (0x96 * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(PCON,6)
// AT1STPTL<STPT0>
extern volatile __bit                   STPT0               __at(0x40D0);	// @ (0x81A * 8 + 0)
#define                                 STPT0_bit           _BIT_ACCESS(AT1STPTL,0)
// AT1STPTL<STPT1>
extern volatile __bit                   STPT1               __at(0x40D1);	// @ (0x81A * 8 + 1)
#define                                 STPT1_bit           _BIT_ACCESS(AT1STPTL,1)
// AT1STPTH<STPT10>
extern volatile __bit                   STPT10              __at(0x40DA);	// @ (0x81B * 8 + 2)
#define                                 STPT10_bit          _BIT_ACCESS(AT1STPTH,2)
// AT1STPTH<STPT11>
extern volatile __bit                   STPT11              __at(0x40DB);	// @ (0x81B * 8 + 3)
#define                                 STPT11_bit          _BIT_ACCESS(AT1STPTH,3)
// AT1STPTH<STPT12>
extern volatile __bit                   STPT12              __at(0x40DC);	// @ (0x81B * 8 + 4)
#define                                 STPT12_bit          _BIT_ACCESS(AT1STPTH,4)
// AT1STPTH<STPT13>
extern volatile __bit                   STPT13              __at(0x40DD);	// @ (0x81B * 8 + 5)
#define                                 STPT13_bit          _BIT_ACCESS(AT1STPTH,5)
// AT1STPTH<STPT14>
extern volatile __bit                   STPT14              __at(0x40DE);	// @ (0x81B * 8 + 6)
#define                                 STPT14_bit          _BIT_ACCESS(AT1STPTH,6)
// AT1STPTL<STPT2>
extern volatile __bit                   STPT2               __at(0x40D2);	// @ (0x81A * 8 + 2)
#define                                 STPT2_bit           _BIT_ACCESS(AT1STPTL,2)
// AT1STPTL<STPT3>
extern volatile __bit                   STPT3               __at(0x40D3);	// @ (0x81A * 8 + 3)
#define                                 STPT3_bit           _BIT_ACCESS(AT1STPTL,3)
// AT1STPTL<STPT4>
extern volatile __bit                   STPT4               __at(0x40D4);	// @ (0x81A * 8 + 4)
#define                                 STPT4_bit           _BIT_ACCESS(AT1STPTL,4)
// AT1STPTL<STPT5>
extern volatile __bit                   STPT5               __at(0x40D5);	// @ (0x81A * 8 + 5)
#define                                 STPT5_bit           _BIT_ACCESS(AT1STPTL,5)
// AT1STPTL<STPT6>
extern volatile __bit                   STPT6               __at(0x40D6);	// @ (0x81A * 8 + 6)
#define                                 STPT6_bit           _BIT_ACCESS(AT1STPTL,6)
// AT1STPTL<STPT7>
extern volatile __bit                   STPT7               __at(0x40D7);	// @ (0x81A * 8 + 7)
#define                                 STPT7_bit           _BIT_ACCESS(AT1STPTL,7)
// AT1STPTH<STPT8>
extern volatile __bit                   STPT8               __at(0x40D8);	// @ (0x81B * 8 + 0)
#define                                 STPT8_bit           _BIT_ACCESS(AT1STPTH,0)
// AT1STPTH<STPT9>
extern volatile __bit                   STPT9               __at(0x40D9);	// @ (0x81B * 8 + 1)
#define                                 STPT9_bit           _BIT_ACCESS(AT1STPTH,1)
// CWG1OCON0<STRA>
extern volatile __bit                   STRA                __at(0x34A8);	// @ (0x695 * 8 + 0)
#define                                 STRA_bit            _BIT_ACCESS(CWG1OCON0,0)
// CWG1OCON0<STRB>
extern volatile __bit                   STRB                __at(0x34A9);	// @ (0x695 * 8 + 1)
#define                                 STRB_bit            _BIT_ACCESS(CWG1OCON0,1)
// CWG1OCON0<STRC>
extern volatile __bit                   STRC                __at(0x34AA);	// @ (0x695 * 8 + 2)
#define                                 STRC_bit            _BIT_ACCESS(CWG1OCON0,2)
// CWG1OCON0<STRD>
extern volatile __bit                   STRD                __at(0x34AB);	// @ (0x695 * 8 + 3)
#define                                 STRD_bit            _BIT_ACCESS(CWG1OCON0,3)
// WDTCON0<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x3888);	// @ (0x711 * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON0,0)
// TX1STA<SYNC>
extern volatile __bit                   SYNC                __at(0xCF4);	// @ (0x19E * 8 + 4)
#define                                 SYNC_bit            _BIT_ACCESS(TX1STA,4)
// T0CKIPPS<T0CKIPPS0>
extern volatile __bit                   T0CKIPPS0           __at(0x7088);	// @ (0xE11 * 8 + 0)
#define                                 T0CKIPPS0_bit       _BIT_ACCESS(T0CKIPPS,0)
// T0CKIPPS<T0CKIPPS1>
extern volatile __bit                   T0CKIPPS1           __at(0x7089);	// @ (0xE11 * 8 + 1)
#define                                 T0CKIPPS1_bit       _BIT_ACCESS(T0CKIPPS,1)
// T0CKIPPS<T0CKIPPS2>
extern volatile __bit                   T0CKIPPS2           __at(0x708A);	// @ (0xE11 * 8 + 2)
#define                                 T0CKIPPS2_bit       _BIT_ACCESS(T0CKIPPS,2)
// T0CKIPPS<T0CKIPPS3>
extern volatile __bit                   T0CKIPPS3           __at(0x708B);	// @ (0xE11 * 8 + 3)
#define                                 T0CKIPPS3_bit       _BIT_ACCESS(T0CKIPPS,3)
// T0CKIPPS<T0CKIPPS4>
extern volatile __bit                   T0CKIPPS4           __at(0x708C);	// @ (0xE11 * 8 + 4)
#define                                 T0CKIPPS4_bit       _BIT_ACCESS(T0CKIPPS,4)
// OPTION_REG<T0CS>
extern volatile __bit                   T0CS                __at(0x4AD);	// @ (0x95 * 8 + 5)
#define                                 T0CS_bit            _BIT_ACCESS(OPTION_REG,5)
// INTCON<T0IE>
extern volatile __bit                   T0IE                __at(0x5D);	// @ (0xB * 8 + 5)
#define                                 T0IE_bit            _BIT_ACCESS(INTCON,5)
// INTCON<T0IF>
extern volatile __bit                   T0IF                __at(0x5A);	// @ (0xB * 8 + 2)
#define                                 T0IF_bit            _BIT_ACCESS(INTCON,2)
// OPTION_REG<T0SE>
extern volatile __bit                   T0SE                __at(0x4AC);	// @ (0x95 * 8 + 4)
#define                                 T0SE_bit            _BIT_ACCESS(OPTION_REG,4)
// T1CKIPPS<T1CKIPPS0>
extern volatile __bit                   T1CKIPPS0           __at(0x7090);	// @ (0xE12 * 8 + 0)
#define                                 T1CKIPPS0_bit       _BIT_ACCESS(T1CKIPPS,0)
// T1CKIPPS<T1CKIPPS1>
extern volatile __bit                   T1CKIPPS1           __at(0x7091);	// @ (0xE12 * 8 + 1)
#define                                 T1CKIPPS1_bit       _BIT_ACCESS(T1CKIPPS,1)
// T1CKIPPS<T1CKIPPS2>
extern volatile __bit                   T1CKIPPS2           __at(0x7092);	// @ (0xE12 * 8 + 2)
#define                                 T1CKIPPS2_bit       _BIT_ACCESS(T1CKIPPS,2)
// T1CKIPPS<T1CKIPPS3>
extern volatile __bit                   T1CKIPPS3           __at(0x7093);	// @ (0xE12 * 8 + 3)
#define                                 T1CKIPPS3_bit       _BIT_ACCESS(T1CKIPPS,3)
// T1CKIPPS<T1CKIPPS4>
extern volatile __bit                   T1CKIPPS4           __at(0x7094);	// @ (0xE12 * 8 + 4)
#define                                 T1CKIPPS4_bit       _BIT_ACCESS(T1CKIPPS,4)
// T1CON<T1CKPS0>
extern volatile __bit                   T1CKPS0             __at(0xC4);	// @ (0x18 * 8 + 4)
#define                                 T1CKPS0_bit         _BIT_ACCESS(T1CON,4)
// T1CON<T1CKPS1>
extern volatile __bit                   T1CKPS1             __at(0xC5);	// @ (0x18 * 8 + 5)
#define                                 T1CKPS1_bit         _BIT_ACCESS(T1CON,5)
// T1GCON<T1GGO_nDONE>
extern volatile __bit                   T1GGO_nDONE         __at(0xCB);	// @ (0x19 * 8 + 3)
#define                                 T1GGO_nDONE_bit     _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GPOL>
extern volatile __bit                   T1GPOL              __at(0xCE);	// @ (0x19 * 8 + 6)
#define                                 T1GPOL_bit          _BIT_ACCESS(T1GCON,6)
// T1GPPS<T1GPPS0>
extern volatile __bit                   T1GPPS0             __at(0x7098);	// @ (0xE13 * 8 + 0)
#define                                 T1GPPS0_bit         _BIT_ACCESS(T1GPPS,0)
// T1GPPS<T1GPPS1>
extern volatile __bit                   T1GPPS1             __at(0x7099);	// @ (0xE13 * 8 + 1)
#define                                 T1GPPS1_bit         _BIT_ACCESS(T1GPPS,1)
// T1GPPS<T1GPPS2>
extern volatile __bit                   T1GPPS2             __at(0x709A);	// @ (0xE13 * 8 + 2)
#define                                 T1GPPS2_bit         _BIT_ACCESS(T1GPPS,2)
// T1GPPS<T1GPPS3>
extern volatile __bit                   T1GPPS3             __at(0x709B);	// @ (0xE13 * 8 + 3)
#define                                 T1GPPS3_bit         _BIT_ACCESS(T1GPPS,3)
// T1GPPS<T1GPPS4>
extern volatile __bit                   T1GPPS4             __at(0x709C);	// @ (0xE13 * 8 + 4)
#define                                 T1GPPS4_bit         _BIT_ACCESS(T1GPPS,4)
// T1GCON<T1GSPM>
extern volatile __bit                   T1GSPM              __at(0xCC);	// @ (0x19 * 8 + 4)
#define                                 T1GSPM_bit          _BIT_ACCESS(T1GCON,4)
// T1GCON<T1GSS0>
extern volatile __bit                   T1GSS0              __at(0xC8);	// @ (0x19 * 8 + 0)
#define                                 T1GSS0_bit          _BIT_ACCESS(T1GCON,0)
// T1GCON<T1GSS1>
extern volatile __bit                   T1GSS1              __at(0xC9);	// @ (0x19 * 8 + 1)
#define                                 T1GSS1_bit          _BIT_ACCESS(T1GCON,1)
// T1GCON<T1GTM>
extern volatile __bit                   T1GTM               __at(0xCD);	// @ (0x19 * 8 + 5)
#define                                 T1GTM_bit           _BIT_ACCESS(T1GCON,5)
// T1GCON<T1GVAL>
extern volatile __bit                   T1GVAL              __at(0xCA);	// @ (0x19 * 8 + 2)
#define                                 T1GVAL_bit          _BIT_ACCESS(T1GCON,2)
// T2CKIPPS<T2CKIPPS0>
extern volatile __bit                   T2CKIPPS0           __at(0x70C0);	// @ (0xE18 * 8 + 0)
#define                                 T2CKIPPS0_bit       _BIT_ACCESS(T2CKIPPS,0)
// T2CKIPPS<T2CKIPPS1>
extern volatile __bit                   T2CKIPPS1           __at(0x70C1);	// @ (0xE18 * 8 + 1)
#define                                 T2CKIPPS1_bit       _BIT_ACCESS(T2CKIPPS,1)
// T2CKIPPS<T2CKIPPS2>
extern volatile __bit                   T2CKIPPS2           __at(0x70C2);	// @ (0xE18 * 8 + 2)
#define                                 T2CKIPPS2_bit       _BIT_ACCESS(T2CKIPPS,2)
// T2CKIPPS<T2CKIPPS3>
extern volatile __bit                   T2CKIPPS3           __at(0x70C3);	// @ (0xE18 * 8 + 3)
#define                                 T2CKIPPS3_bit       _BIT_ACCESS(T2CKIPPS,3)
// T2CKIPPS<T2CKIPPS4>
extern volatile __bit                   T2CKIPPS4           __at(0x70C4);	// @ (0xE18 * 8 + 4)
#define                                 T2CKIPPS4_bit       _BIT_ACCESS(T2CKIPPS,4)
// T2HLT<T2CKPOL>
extern volatile __bit                   T2CKPOL             __at(0xEE);	// @ (0x1D * 8 + 6)
#define                                 T2CKPOL_bit         _BIT_ACCESS(T2HLT,6)
// T2CON<T2CKPS0>
extern volatile __bit                   T2CKPS0             __at(0xE4);	// @ (0x1C * 8 + 4)
#define                                 T2CKPS0_bit         _BIT_ACCESS(T2CON,4)
// T2CON<T2CKPS1>
extern volatile __bit                   T2CKPS1             __at(0xE5);	// @ (0x1C * 8 + 5)
#define                                 T2CKPS1_bit         _BIT_ACCESS(T2CON,5)
// T2CON<T2CKPS2>
extern volatile __bit                   T2CKPS2             __at(0xE6);	// @ (0x1C * 8 + 6)
#define                                 T2CKPS2_bit         _BIT_ACCESS(T2CON,6)
// T2HLT<T2CKSYNC>
extern volatile __bit                   T2CKSYNC            __at(0xED);	// @ (0x1D * 8 + 5)
#define                                 T2CKSYNC_bit        _BIT_ACCESS(T2HLT,5)
// T2CLKCON<T2CS0>
extern volatile __bit                   T2CS0               __at(0xF0);	// @ (0x1E * 8 + 0)
#define                                 T2CS0_bit           _BIT_ACCESS(T2CLKCON,0)
// T2CLKCON<T2CS1>
extern volatile __bit                   T2CS1               __at(0xF1);	// @ (0x1E * 8 + 1)
#define                                 T2CS1_bit           _BIT_ACCESS(T2CLKCON,1)
// T2CLKCON<T2CS2>
extern volatile __bit                   T2CS2               __at(0xF2);	// @ (0x1E * 8 + 2)
#define                                 T2CS2_bit           _BIT_ACCESS(T2CLKCON,2)
// T2CLKCON<T2CS3>
extern volatile __bit                   T2CS3               __at(0xF3);	// @ (0x1E * 8 + 3)
#define                                 T2CS3_bit           _BIT_ACCESS(T2CLKCON,3)
// T2HLT<T2MODE0>
extern volatile __bit                   T2MODE0             __at(0xE8);	// @ (0x1D * 8 + 0)
#define                                 T2MODE0_bit         _BIT_ACCESS(T2HLT,0)
// T2HLT<T2MODE1>
extern volatile __bit                   T2MODE1             __at(0xE9);	// @ (0x1D * 8 + 1)
#define                                 T2MODE1_bit         _BIT_ACCESS(T2HLT,1)
// T2HLT<T2MODE2>
extern volatile __bit                   T2MODE2             __at(0xEA);	// @ (0x1D * 8 + 2)
#define                                 T2MODE2_bit         _BIT_ACCESS(T2HLT,2)
// T2HLT<T2MODE3>
extern volatile __bit                   T2MODE3             __at(0xEB);	// @ (0x1D * 8 + 3)
#define                                 T2MODE3_bit         _BIT_ACCESS(T2HLT,3)
// T2HLT<T2MODE4>
extern volatile __bit                   T2MODE4             __at(0xEC);	// @ (0x1D * 8 + 4)
#define                                 T2MODE4_bit         _BIT_ACCESS(T2HLT,4)
// T2CON<T2ON>
extern volatile __bit                   T2ON                __at(0xE7);	// @ (0x1C * 8 + 7)
#define                                 T2ON_bit            _BIT_ACCESS(T2CON,7)
// T2CON<T2OUTPS0>
extern volatile __bit                   T2OUTPS0            __at(0xE0);	// @ (0x1C * 8 + 0)
#define                                 T2OUTPS0_bit        _BIT_ACCESS(T2CON,0)
// T2CON<T2OUTPS1>
extern volatile __bit                   T2OUTPS1            __at(0xE1);	// @ (0x1C * 8 + 1)
#define                                 T2OUTPS1_bit        _BIT_ACCESS(T2CON,1)
// T2CON<T2OUTPS2>
extern volatile __bit                   T2OUTPS2            __at(0xE2);	// @ (0x1C * 8 + 2)
#define                                 T2OUTPS2_bit        _BIT_ACCESS(T2CON,2)
// T2CON<T2OUTPS3>
extern volatile __bit                   T2OUTPS3            __at(0xE3);	// @ (0x1C * 8 + 3)
#define                                 T2OUTPS3_bit        _BIT_ACCESS(T2CON,3)
// T2CKIPPS<T2PPS0>
extern volatile __bit                   T2PPS0              __at(0x70C0);	// @ (0xE18 * 8 + 0)
#define                                 T2PPS0_bit          _BIT_ACCESS(T2CKIPPS,0)
// T2CKIPPS<T2PPS1>
extern volatile __bit                   T2PPS1              __at(0x70C1);	// @ (0xE18 * 8 + 1)
#define                                 T2PPS1_bit          _BIT_ACCESS(T2CKIPPS,1)
// T2CKIPPS<T2PPS2>
extern volatile __bit                   T2PPS2              __at(0x70C2);	// @ (0xE18 * 8 + 2)
#define                                 T2PPS2_bit          _BIT_ACCESS(T2CKIPPS,2)
// T2CKIPPS<T2PPS3>
extern volatile __bit                   T2PPS3              __at(0x70C3);	// @ (0xE18 * 8 + 3)
#define                                 T2PPS3_bit          _BIT_ACCESS(T2CKIPPS,3)
// T2CKIPPS<T2PPS4>
extern volatile __bit                   T2PPS4              __at(0x70C4);	// @ (0xE18 * 8 + 4)
#define                                 T2PPS4_bit          _BIT_ACCESS(T2CKIPPS,4)
// T2HLT<T2PSYNC>
extern volatile __bit                   T2PSYNC             __at(0xEF);	// @ (0x1D * 8 + 7)
#define                                 T2PSYNC_bit         _BIT_ACCESS(T2HLT,7)
// T2RST<T2RSEL0>
extern volatile __bit                   T2RSEL0             __at(0xF8);	// @ (0x1F * 8 + 0)
#define                                 T2RSEL0_bit         _BIT_ACCESS(T2RST,0)
// T2RST<T2RSEL1>
extern volatile __bit                   T2RSEL1             __at(0xF9);	// @ (0x1F * 8 + 1)
#define                                 T2RSEL1_bit         _BIT_ACCESS(T2RST,1)
// T2RST<T2RSEL2>
extern volatile __bit                   T2RSEL2             __at(0xFA);	// @ (0x1F * 8 + 2)
#define                                 T2RSEL2_bit         _BIT_ACCESS(T2RST,2)
// T2RST<T2RSEL3>
extern volatile __bit                   T2RSEL3             __at(0xFB);	// @ (0x1F * 8 + 3)
#define                                 T2RSEL3_bit         _BIT_ACCESS(T2RST,3)
// T3CKIPPS<T3CKIPPS0>
